{
  "https://en.wikipedia.org/wiki/Ninja": "Title: Ninja\n\nURL Source: https://en.wikipedia.org/wiki/Ninja\n\nPublished Time: 2002-03-28T14:32:58Z\n\nMarkdown Content:\nJump to content \n  \n  \n   Main menu  \n \n \n \n \nMain menu \nmove to sidebar \nhide  \n \n Navigation  \n \n \nMain page\nContents\nCurrent events\nRandom article\nAbout Wikipedia\nContact us    \n \n Contribute  \n \n \nHelp\nLearn to edit\nCommunity portal\nRecent changes\nUpload file\nSpecial pages                 \n \n  Search  \n \n \n \n \n      \nSearch      \n \n \n \n    \n \n \n     \n   Appearance  \n \n     \n \n \n    \n \n \n \nDonate  \nCreate account  \nLog in      \n   Personal tools  \n \n \n \n \nDonate\n Create account\n Log in    \n \n Pages for logged out editors learn more  \n \n \nContributions\nTalk          \n \n \n \n  \n \n \n  \n     \n  \n \n \n \nContents \nmove to sidebar \nhide  \n \n  \n(Top)   \n  \n 1 Etymology   \n   \n  \n 2 History   \n  Toggle History subsection  \n \n  \n 2.1 Predecessors   \n   \n  \n 2.2 Early history   \n   \n  \n 2.3 Iga and Kōga clans   \n   \n  \n 2.4 Activities under Tokugawa   \n   \n  \n 2.5 Shimabara rebellion   \n   \n  \n 2.6 Edo period   \n \n  \n 2.6.1 Ninja stereotypes in theatre   \n     \n  \n 2.7 Contemporary   \n     \n  \n 3 Roles   \n  Toggle Roles subsection  \n \n  \n 3.1 Espionage   \n   \n  \n 3.2 Sabotage   \n   \n  \n 3.3 Countermeasures   \n     \n  \n 4 Foreign ninja   \n   \n  \n 5 Famous people   \n   \n  \n 6 In popular culture   \n   \n  \n 7 Gallery   \n   \n  \n 8 See also   \n   \n  \n 9 Notes   \n   \n  \n 10 References   \n  Toggle References subsection  \n \n  \n 10.1 Citations   \n   \n  \n 10.2 Sources   \n     \n  \n 11 Further reading   \n   \n  \n 12 External links   \n         \n    \n   Toggle the table of contents  \n \n     \nNinja \n   79 languages  \n \n \n \nالعربية\nAsturianu\nAzərbaycanca\nবাংলা\n閩南語 / Bân-lâm-gú\nБашҡортса\nБеларуская\nBikol Central\nБългарски\nBosanski\nCatalà\nCebuano\nČeština\nDansk\nالدارجة\nDeutsch\nEesti\nΕλληνικά\nEspañol\nEsperanto\nEuskara\nفارسی\nFrançais\nGalego\n贛語\n한국어\nՀայերեն\nहिन्दी\nHrvatski\nBahasa Indonesia\nÍslenska\nItaliano\nעברית\nJawa\nქართული\nКыргызча\nLatina\nLatviešu\nLietuvių\nMagyar\nМакедонски\nമലയാളം\nმარგალური\nمصرى\nمازِرونی\nBahasa Melayu\nမြန်မာဘာသာ\nNederlands\n日本語\nNorsk bokmål\nOccitan\nOʻzbekcha / ўзбекча\nپنجابی\nPolski\nPortuguês\nRomână\nRuna Simi\nРусский\nShqip\nSimple English\nسنڌي\nSlovenščina\nکوردی\nСрпски / srpski\nSrpskohrvatski / српскохрватски\nSuomi\nSvenska\nTagalog\nதமிழ்\nతెలుగు\nไทย\nTürkçe\nУкраїнська\nاردو\nTiếng Việt\n吴语\nייִדיש\n粵語\n中文  \nEdit links     \n \n \n  \n \n \n \nArticle\nTalk    \n  English  \n \n \n \n        \n  \n \n \n \nRead\nView source\nView history      \n  Tools  \n \n \n \n \nTools \nmove to sidebar \nhide  \n \n Actions  \n \n \nRead\nView source\nView history    \n \n General  \n \n \nWhat links here\nRelated changes\nUpload file\nPermanent link\nPage information\nCite this page\nGet shortened URL\nDownload QR code    \n \n Print/export  \n \n \nDownload as PDF\nPrintable version    \n \n In other projects  \n \n \nWikimedia Commons\nWikidata item            \n \n  \n    \n \n \n \nAppearance \nmove to sidebar \nhide       \n \n \n \n\n  \nFrom Wikipedia, the free encyclopedia  \n\n \n\n\nMercenary and spy in feudal Japan \nSeveral terms redirect here. For other uses, see Ninja (disambiguation) and Shinobi (disambiguation). \n  \n\nDrawing of the archetypical ninja from a series of sketches by Hokusai. Woodblock print on paper. Vol. six, 1817. \nA ninja (忍者, English: /ˈnɪn.dʒə/,[1] Japanese: [ɲiꜜɲ.dʑa][2]) or shinobi (忍び, Japanese: [ɕi.no.bʲi][2]) was a spy and infiltrator in pre-modern Japan.[3] The functions of a ninja included siege and infiltration, ambush, reconnaissance, espionage, deception, and later bodyguarding.[4] Antecedents may have existed as early as the 12th century.[5][6] There is little evidence that they were assassins.[3] \nIn the unrest of the Sengoku period, jizamurai families, that is, elite peasant-warriors, in Iga Province and the adjacent Kōka District formed ikki – \"revolts\" or \"leagues\" – as a means of self-defense. They became known for their military activities in the nearby regions and sold their services as mercenaries and spies. It is from these areas that much of the knowledge regarding the ninja is drawn.[7] Following the Tokugawa shogunate in the 17th century, the ninja faded into obscurity.[8] A number of shinobi manuals, often based on Chinese military philosophy, were written in the 17th and 18th centuries, most notably the Bansenshūkai (1676).[9] \nBy the time of the Meiji Restoration (1868), shinobi had become a topic of popular imagination and mystery in Japan. Ninja figured prominently in legend and folklore, where they were associated with legendary abilities such as invisibility, walking on water, and control over natural elements. Much of their perception in popular culture is based on such legends and folklore, as opposed to the covert actors of the Sengoku period.   \n\nEtymology \n\nThe word \"ninja\" in kanji script \nNinja is the on'yomi (Early Middle Chinese–influenced) reading of the two kanji \"忍者\". In the native kun'yomi reading, it is pronounced shinobi, a shortened form of shinobi-no-mono (忍びの者).[10] \nThe word shinobi appears in the written record as far back as the late 8th century in poems in the Man'yōshū.[11][12] The underlying connotation of shinobi (忍) means \"to steal away; to hide\" and—by extension—\"to forbear\", hence its association with stealth and invisibility. Mono (者) means \"a person\". \nHistorically, the word ninja was not in common use, and a variety of regional colloquialisms evolved to describe what would later be dubbed ninja. Along with shinobi, these include monomi (\"one who sees\"), nokizaru (\"macaque on the roof\"), rappa (\"ruffian\"), kusa (\"grass\") and Iga-mono (\"one from Iga\").[8] In historical documents, shinobi is almost always used. \nKunoichi (くノ一) is, originally, an argot which means \"woman\";[13]: p168  it supposedly comes from the characters くノ一 (respectively hiragana ku, katakana no and kanji ichi), which make up the three strokes that form the kanji for \"woman\" (女).[13]: p168  In fiction written in the modern era kunoichi means \"female ninja\".[13]: p167  \nIn English, the plural of ninja can be either unchanged as ninja, reflecting the Japanese language's lack of grammatical number, or the regular English plural ninjas.[14]  \n\nHistory \nDespite many popular folktales, historical accounts of the ninja are scarce. The social origin of the ninja is seen as the reason they agree to operate in secret, trading their service for money without honor and glory.[15] \nHowever, some ninjutsu books described specifically what tactics ninja should use to fight, and the scenarios in which a ninja might find themselves can be deduced from those tactics. For example, in the manuscript of volume 2 of Kanrin Seiyō (間林清陽) which is the original book of Bansenshūkai (万川集海), there are 48 points of ninja's fighting techniques, such as how to make makibishi from bamboo, how to make footwear that makes no sound, fighting techniques when surrounded by many enemies, precautions when using swords at night, how to listen to small sounds, kuji-kiri that prevents guard dogs from barking, and so on.[16][17]  \n\nPredecessors \n\nYamato Takeru dressed as a maidservant, preparing to kill the Kumaso leaders. Woodblock print on paper. Yoshitoshi, 1886. \nThe title ninja has sometimes been attributed retrospectively to the semi-legendary 2nd-century prince Yamato Takeru.[18] In the Kojiki, the young Yamato Takeru disguised himself as a charming maiden and assassinated two chiefs of the Kumaso people.[19] However, these records take place at a very early stage of Japanese history, and they are unlikely to be connected to the shinobi of later accounts. The first recorded use of espionage was under the employment of Prince Shōtoku in the 6th century.[20] Such tactics were considered unsavory even in early times, when, according to the 10th-century Shōmonki, the boy spy Hasetsukabe no Koharumaru was killed for spying against the insurgent Taira no Masakado.[21] Later, the 14th-century war chronicle Taiheiki contained many references to shinobi[18] and credited the destruction of a castle by fire to an unnamed but \"highly skilled shinobi\".  \n\nEarly history \nIt was not until the 15th century that spies were specially trained for their purpose. It was around this time that the word shinobi appeared to define and clearly identify ninja as a secretive group of agents. Evidence for this can be seen in historical documents, which began to refer to stealthy soldiers as shinobi during the Sengoku period. Later manuals regarding espionage are often grounded in Chinese military strategy, quoting works such as The Art of War by Sun Tzu.[22] \nBy the Sengoku period, the shinobi had several roles, including spy (kanchō), scout (teisatsu), surprise attacker (kishu), and agitator (konran). The ninja families were organized into larger guilds, each with their own territories.[23] A system of rank existed. A jōnin (\"upper person\") was the highest rank, representing the group and hiring out mercenaries. This is followed by the chūnin (\"middle person\"), assistants to the jōnin. At the bottom was the genin (\"lower person\"), field agents drawn from the lower class and assigned to carry out actual missions.[24]  \n\nIga and Kōga clans \nMain articles: Iga ikki, Kōka ikki, and Iga–Kōka alliance \n\nThe plains of Iga, nested in secluded mountains, gave rise to villages specialized in the training of ninja. \nThe Iga and Kōga \"clans\" were jizamurai families living in the province of Iga (modern Mie Prefecture) and the adjacent region of Kōka (later written as Kōga), named after a village in what is now Shiga Prefecture. From these regions, villages devoted to the training of ninja first appeared.[25] The remoteness and inaccessibility of the surrounding mountains in Iga may have had a role in the ninja's secretive development.[24] The chronicle Go Kagami Furoku writes, of the two clans' origins:  \n\nThere was a retainer of the family of Kawai Aki-no-kami of Iga, of pre-eminent skill in shinobi, and consequently for generations the name of people from Iga became established. Another tradition grew in Kōga. \nLikewise, a supplement to the Nochi Kagami, a record of the Ashikaga shogunate, confirms the same Iga origin:  \n\nInside the camp at Magari of the shōgun [Ashikaga] Yoshihisa there were shinobi whose names were famous throughout the land. When Yoshihisa attacked Rokkaku Takayori, the family of Kawai Aki-no-kami of Iga, who served him at Magari, earned considerable merit as shinobi in front of the great army of the shōgun. Since then successive generations of Iga men have been admired. This is the origin of the fame of the men of Iga. \nThese professional ninja were actively hired by daimyōs between 1485 and 1581. Specifically, the Iga professionals were sought after for their skill at siege warfare, or \"shirotori\", which included night attacks and ambush.[26] By the 1460s, the leading families in the regions had established de facto independence from their shugo. The Kōka ikki persisted until 1574, when it was forced to become a vassal of Oda Nobunaga. The Iga ikki continued until 1581, when Nobunaga invaded Iga Province and wiped out the organized clans.[27] Survivors were forced to flee, some to the mountains of Kii, but others arrived before Tokugawa Ieyasu, where they were well treated. Some former Iga clan members, including Hattori Hanzō, would later serve as Tokugawa's bodyguards.[28] Prior to the conquest of Kōka in 1574, the two confederacies worked in alliance together from at least 1487. \nFollowing the Battle of Okehazama in 1560, Tokugawa employed a group of eighty Kōga ninja, led by Tomo Sukesada. They were tasked to raid an outpost of the Imagawa clan. The account of this assault is given in the Mikawa Go Fudoki, where it was written that Kōga ninja infiltrated the castle, set fire to its towers, and killed the castellan along with two hundred of the garrison.  \n\nActivities under Tokugawa \nAfter the assassination of Oda Nobunaga, Iga and Kōka ninja, according to tradition, helped Ieyasu undergo an arduous journey to escape the enemies of Nobunaga in Sakai and return to Mikawa. However, their journey was very dangerous due to the existence of \"Ochimusha-gari\" groups across the route.[a] During this journey, Tokugawa generals such as Ii Naomasa, Sakai Tadatsugu and Honda Tadakatsu fought their way through raids and harassment from Ochimusha-gari (Samurai hunter) outlaws to secure the way for Ieyasu, while sometimes advancing by usage of gold and silver bribes given to some of the more amenable Ochimusha-gari groups.[32] As they reached Kada, an area between Kameyama town and Iga,[33] The attacks from Ochimusha-gari finally ended as they reached the former territory of the Kōka ikki, who were friendly to the Tokugawa clan. The Koka ninja assisted the Tokugawa escort group in eliminating the threats of Ochimusha-gari outlaws then escorting them until they reached Iga Province, where they were further protected by samurai clans from Iga ikki which accompanied the Ieyasu group until they safely reached Mikawa. The Ietada nikki journal records that the escort group of Ieyasu has killed some 200 outlaws during their journey from Osaka.[34][35] \nThe Kōga ninja are said to have played a role in the later Battle of Sekigahara (1600), where several hundred Kōga assisted soldiers under Torii Mototada in the defence of Fushimi Castle. After Tokugawa's victory at Sekigahara, the Iga acted as guards for the inner compounds of Edo Castle, while the Kōga acted as a police force and assisted in guarding the outer gate.[28] In 1603, a group of ninja warriors from Iga clan led by Miura Yo'emon were assigned under the command of Red Demon brigades of Ii Naomasa, the daimyo of Hikone under Tokugawa shogunate. \nIn 1608, a daimyo named Tōdō Takatora was assigned by Ieyasu to control of Tsu, a newly established domain which covered portions of Iga and Ise Province. The domain at first worth of to the 220,000,[36] then grow further in productivity to the total revenue of 320,000 koku under Takatora governance.[37][38] It was reported that Tōdō Takatora employs the Iga-ryū Ninjas. Aside from Ninjas, he also employs local clans of Iga province as \"Musokunin\", which is a class of part time Samurai who has been allowed to retain their clan name but does not own any land or Han. The Musokunin also worked as farmer during peace, while they are obliged to take arms in the time of war.[39][40][41] \nIn 1614, The Iga province warriors saw action during the siege of Osaka. Takatora brought the Musokunin auxiliaries from Iga province to besiege the Osaka castle during the winter phase.[39][40] Meanwhile the ninja units of Iga province were deployed under several commanders such as Hattori Hanzō, and Yamaoka Kagetsuge, and Ii Naotora, heir of Naomasa who also given control of Ii clan's Red Demons ninjas after Naomasa died. Later in 1615, during the summer phase of Osaka siege, The Ii clan Red Demons ninjas led by Miura Yo'emon, Shimotani Sanzo, Okuda Kasa'emon, and Saga Kita'emon saw action once again during the Battle of Tennōji, as they were reportedly fought together with the Tokugawa regular army storming on the south gate of Osaka castle. In 1614, the initial \"winter campaign\" at the Siege of Osaka saw the ninja in use once again. Miura Yoemon, a ninja in Tokugawa's service, recruited shinobi from the Iga region, and sent 10 ninja into Osaka Castle in an effort to foster antagonism between enemy commanders.During the later \"summer campaign\", these hired ninja fought alongside regular troops at the Battle of Tennōji.  \n\nShimabara rebellion \n\nNinja historic illustration, Meiwa era, c. 1770 \nA final but detailed record of ninja employed in open warfare occurred during the Shimabara Rebellion (1637–1638). The Kōga ninja were recruited by shōgun Tokugawa Iemitsu against Christian rebels led by Amakusa Shirō, who made a final stand at Hara Castle, in Hizen Province. A diary kept by a member of the Matsudaira clan, the Amakusa Gunki, relates: \"Men from Kōga in Ōmi Province who concealed their appearance would steal up to the castle every night and go inside as they pleased.\" \nThe Ukai diary, written by a descendant of Ukai Kanemon, has several entries describing the reconnaissance actions taken by the Kōga.  \n\nThey [the Kōga] were ordered to reconnoitre the plan of construction of Hara Castle, and surveyed the distance from the defensive moat to the ni-no-maru (second bailey), the depth of the moat, the conditions of roads, the height of the wall, and the shape of the loopholes.[42]\n— Entry: 6th day of the 1st month \n\nThe ruins of Hara Castle \nSuspecting that the castle's supplies might be running low, the siege commander Matsudaira Nobutsuna ordered a raid on the castle's provisions. Here, the Kōga captured bags of enemy provisions, and infiltrated the castle by night, obtaining secret passwords. Days later, Nobutsuna ordered an intelligence gathering mission to determine the castle's supplies. Several Kōga ninja—some apparently descended from those involved in the 1562 assault on an Imagawa clan castle—volunteered despite being warned that chances of survival were slim. A volley of shots was fired into the sky, causing the defenders to extinguish the castle lights in preparation. Under the cloak of darkness, ninja disguised as defenders infiltrated the castle, capturing a banner of the Christian cross. The Ukai diary writes,  \n\nWe dispersed spies who were prepared to die inside Hara castle. ... those who went on the reconnaissance in force captured an enemy flag; both Arakawa Shichirobei and Mochizuki Yo'emon met extreme resistance and suffered from their serious wounds for 40 days.\n— Entry: 27th day of the 1st month \nAs the siege went on, the extreme shortage of food later reduced the defenders to eating moss and grass. This desperation would mount to futile charges by the rebels, where they were eventually defeated by the shogunate army. The Kōga would later take part in conquering the castle:  \n\nMore and more general raids were begun, the Kōga ninja band under the direct control of Matsudaira Nobutsuna captured the ni-no-maru and the san-no-maru (outer bailey)\n— Entry: 24th day of the 2nd month \nWith the fall of Hara Castle, the Shimabara Rebellion came to an end, and Christianity in Japan was forced underground.[43] These written accounts are the last mention of ninja in war.[44]  \n\nEdo period \nAfter the Shimabara Rebellion, there were almost no major wars or battles until the bakumatsu era. To earn a living, ninja had to be employed by the governments of their Han (domain), or change their profession. Many lords still hired ninja, not for battle but as bodyguards or spies. Their duties included spying on other domains, guarding the daimyō, and fire patrol.[45] A few domains like Tsu, Hirosaki and Saga continued to employ their own ninja into the bakumatsu era, although their precise numbers are unknown.[46][47] \nMany former ninja were employed as security guards by the Tokugawa shogunate, though the role of espionage was transferred to newly created organizations like the onmitsu and the oniwaban.[48] Others used their ninjutsu knowledge to become doctors, medicine sellers, merchants, martial artists, and fireworks manufacturers.[49] Some unemployed ninja were reduced to banditry, such as Fūma Kotarō and Ishikawa Goemon.[50]    Ninja employed in each domain, Edo period[51]   Han (domain)  Number of ninja   Kishū Domain  200+   Kishiwada Domain  50   Kawagoe Domain  50   Matsue Domain  30   Hirosaki Domain  20   Fukui Domain  12   Hikone Domain  10   Okayama Domain  10   Akō Domain  5  \n\nNinja stereotypes in theatre \n\n\n\n\n\nIn Sakura doki onna gyoretsu, this onnagata is attended by three kuroko.\n\n\nIn Nise Murasaki Inaka Genji, Ashikaga Mitsuuji is approached unknowingly by a ninja.\n\nTwo prints depicting kabuki plays. In Japanese theatre, ninja are often dressed as kuroko, stagehands in black suits, to make their attacks seem more surprising. This practice gave rise to their stereotypical black outfits.[52] \nMany ubiquitous stereotypes about ninja were developed within Edo theatre. These include their black clothing, which was supposed to imitate the outfits worn by kuroko, stagehands meant to be ignored by the audience; and their use of shuriken, which was meant to contrast with the use of swords by onstage samurai. In kabuki theatre, ninja were \"dishonorable and often sorcerous counterparts\" to samurai, and possessed \"almost, if not outright, magical means of camouflage.\"[52]  \n\nContemporary \n\nA copy of the legendary 40-page book called Kanrinseiyo made in 1748 \nBetween 1960 and 2010 artifacts dating to the Siege of Odawara (1590) were uncovered which experts say are ninja weapons.[53] Ninja were spies and saboteurs and likely participated in the siege.[53] The Hojo clan failed to save the castle from Toyotomi Hideyoshi forces.[53] The uncovered flat throwing stones are likely predecessors of the shuriken.[53] The clay caltrops preceded makibishi caltrops.[53] Archeologist Iwata Akihiro of Saitama Prefectural Museum of History and Folklore said the flat throwing stones \"were used to stop the movement of the enemy who was going to attack [a soldier] at any moment, and while the enemy freezed the soldier escaped,\".[53] The clay caltrops could \"stop the movement of the enemy who invaded the castle,\" These weapons were hastily constructed yet effective and used by a \"battle group which can move into action as ninjas\".[53] \nMie University founded the world's first research centre devoted to the ninja in 2017. A graduate master course opened in 2018. It is located in Iga (now Mie Prefecture). There are approximately 3 student enrollments per year. Students must pass an admission test about Japanese history and be able to read historical ninja documents.[54] Scientific researchers and scholars of different disciplines study ancient documents and how it can be used in the modern world.[55] \nOn June 19, 2022, Kōka city in Shiga Prefecture announced that a written copy of \"Kanrinseiyo\", which is the original source of a famous book on the art of ninja called \"Bansenshukai\" (1676) from the Edo period was discovered in a warehouse of Kazuraki Shrine.[56] The handwritten reproduction was produced in 1748.[57] The book describes 48 types of ninjutsu.[56] It has information about specific methods such as attaching layers of cotton to the bottom of straw sandals to prevent noise when sneaking around, attacking to the right when surrounded by a large number of enemies, throwing charred owl and turtle powder when trying to hide, and casting spells.[56] It also clarified methods and how to manufacture and use ninjutsu tools, such as cane swords and \"makibishi\" (Japanese caltrop).[56]  \n\nRoles \nIn his Buke Myōmokushō, military historian Hanawa Hokinoichi writes of the ninja:  \n\nThey travelled in disguise to other territories to judge the situation of the enemy, they would inveigle their way into the midst of the enemy to discover gaps, and enter enemy castles to set them on fire, and carried out assassinations, arriving in secret. \n\nEspionage \nEspionage was the chief role of the ninja. With the aid of disguises, the ninja gathered information on enemy terrain and building specifications, as well as obtaining passwords and communiques. The aforementioned supplement to the Nochi Kagami briefly describes the ninja's role in espionage:  \n\nConcerning ninja, they were said to be from Iga and Kōga, and went freely into enemy castles in secret. They observed hidden things, and were taken as being friends. \nLater in history, the Kōga ninja would become regarded as agents of the Tokugawa bakufu, at a time when the bakufu used the ninja in an intelligence network to monitor regional daimyōs as well as the Imperial court.[23]  \n\nSabotage \nArson was the primary form of sabotage practiced by the ninja, who targeted castles and camps. \nThe Tamon-in Nikki (16th century)—a diary written by abbot Eishun of Kōfuku-ji temple—describes an arson attack on a castle by men of the Iga clans.  \n\nThis morning, the sixth day of the 11th month of Tenbun 10 [1541], the Iga-shu entered Kasagi castle in secret and set fire to a few of the priests' quarters. They also set fire to outbuildings in various places inside the San-no-maru. They captured the ichi-no-maru (inner bailey) and the ni-no-maru (second bailey). \nIn 1558, Rokkaku Yoshikata employed a team of ninja to set fire to Sawayama Castle. A chūnin captain led a force of 48 ninja into the castle by means of deception. In a technique dubbed bakemono-jutsu (\"ghost technique\"), his men stole a lantern bearing the enemy's family crest (mon), and proceeded to make replicas with the same mon. By wielding these lanterns, they were allowed to enter the castle without a fight. Once inside, the ninja set fire to the castle, and Yoshitaka's army would later emerge victorious. The mercenary nature of the shinobi is demonstrated in another arson attack soon after the burning of Sawayama Castle. In 1561, commanders acting under Kizawa Nagamasa hired three Iga ninja of genin rank to assist the conquest of a fortress in Maibara. Rokkaku Yoshitaka, the same man who had hired Iga ninja just years earlier, was the fortress holder—and target of attack. The Asai Sandaiki writes of their plans: \"We employed shinobi-no-mono of Iga... They were contracted to set fire to the castle\". However, the mercenary shinobi were unwilling to take commands. When the fire attack did not begin as scheduled, the Iga men told the commanders, who were not from the region, that they could not possibly understand the tactics of the shinobi. They then threatened to abandon the operation if they were not allowed to act on their own strategy. The fire was eventually set, allowing Nagamasa's army to capture the fortress in a chaotic rush.  \n\nCountermeasures \nA variety of countermeasures were taken to prevent the activities of the ninja. Precautions were often taken against assassinations, such as weapons concealed in the lavatory, or under a removable floorboard. Buildings were constructed with traps and trip wires attached to alarm bells.[58] \nJapanese castles were designed to be difficult to navigate, with winding routes leading to the inner compound. Blind spots and holes in walls provided constant surveillance of these labyrinthine paths, as exemplified in Himeji Castle. Nijō Castle in Kyoto is constructed with long \"nightingale\" floors, which rested on metal hinges (uguisu-bari) specifically designed to squeak loudly when walked over. Grounds covered with gravel also provided early notice of unwanted intruders, and segregated buildings allowed fires to be better contained.[59]  \n\nForeign ninja \nOn February 25, 2018, Yamada Yūji, the professor of Mie University and historian Nakanishi Gō announced that they had identified three people who were successful in early modern Ureshino, including the ninja Benkei Musō (弁慶夢想).[47][60] Musō is thought to be the same person as Denrinbō Raikei (伝林坊頼慶), the Chinese disciple of Marume Nagayoshi.[60] It came as a shock when the existence of a foreign samurai was verified by authorities.  \n\nFamous people \n\nKumawakamaru escapes his pursuers by swinging across the moat on a bamboo.[61] Woodblock print on paper. Kuniyoshi, 1842–1843. \nMany famous people in Japanese history have been associated or identified as ninja, but their status as ninja is difficult to prove and may be the product of later imagination. Rumors surrounding famous warriors, such as Kusunoki Masashige or Minamoto no Yoshitsune sometimes describe them as ninja, but there is little evidence for these claims. \nSome well known examples include:  \n\nKumawaka (the 16th century): a suppa (ninja) who served Obu Toramasa (1504– 1565), a vassal of Takeda Shingen.[62] \nHattori Hanzō (1542–1596): a samurai serving under Tokugawa Ieyasu. His ancestry in Iga province, along with ninjutsu manuals published by his descendants have led some sources to define him as a ninja.[63] This depiction is also common in popular culture. \nIshikawa Goemon (1558–1594): Goemon reputedly tried to drip poison from a thread into Oda Nobunaga's mouth through a hiding spot in the ceiling,[64] but many fanciful tales exist about Goemon, and this story cannot be confirmed. \nFūma Kotarō (d. 1603): a ninja rumored to have killed Hattori Hanzō, with whom he was supposedly rivals. The fictional weapon Fūma shuriken is named after him. \nMomochi Sandayū (16th century): a leader of the Iga ninja clans, who supposedly perished during Oda Nobunaga's attack on Iga province. There is some belief that he escaped death and lived as a farmer in Kii Province.[65] Momochi is also a branch of the Hattori clan. \nFujibayashi Nagato-no-kami (16th century): considered to be one of three \"greatest\" Iga jōnin, the other two being Hattori Hanzō and Momochi Sandayū. Fujibayashi's descendants wrote and edited the Bansenshukai. \nKatō Danzō (1503–1569): a famed 16th-century ninja master during the Sengoku period who was also known as \"Flying Katō\". \nWada Koremasa (1536–1571): a powerful Kōka samurai ninja who in 1568 allied with the Ashikaga shogunate and Oda Nobunaga, at which point he relocated to Settsu Province. \nShimotsuge no Kizaru (16th century): an influential Iga ninja who in 1560 successfully led an attack on Tōichi Castle. \nTakino Jurobei (16th century): The commander of some of the final resistance against Oda Nobunaga in his invasion of Iga. Momochi Sandayu, Fujibayashi Nagato no Kami, and Hattori Hanzō served as his officers. \n\nIn popular culture \nMain article: Ninjas in popular culture \n\nJiraiya battles a giant python with the help of his summoned toad. Woodblock print on paper. Kuniyoshi, c. 1843. \nThe image of the ninja entered popular culture in the Edo period, when folktales and plays about ninja were conceived. Stories about the ninja are usually based on historical figures. For instance, many similar tales exist about a daimyō challenging a ninja to prove his worth, usually by stealing his pillow or weapon while he slept.[66] Novels were written about the ninja, such as Jiraiya Gōketsu Monogatari, which was also made into a kabuki play. Fictional figures such as Sarutobi Sasuke would eventually make their way into comics and television, where they have come to enjoy a culture hero status outside their original mediums. \nNinja appear in many forms of Japanese and Western popular media, including books (Kōga Ninpōchō), movies (Enter the Ninja, Revenge of the Ninja, Ninja Assassin), television (Akakage, The Master, Ninja Warrior), video games (Shinobi, Ninja Gaiden, Tenchu, Sekiro, Assassin's Creed), anime (Naruto, Ninja Scroll, Gatchaman), manga (Basilisk, Ninja Hattori-kun, Azumi), Western animation (Ninjago: Masters of Spinjitzu) and American comic books (Teenage Mutant Ninja Turtles). From ancient Japan to the modern world media, popular depictions range from the realistic to the fantastically exaggerated, both fundamentally and aesthetically.  \n\nGallery \n \n \n \nTekko-kagi, hand claws  \n \n \nAshiko, iron climbing cleats  \n \n \nAshiko, iron climbing cleats  \n \n \nKaginawa, iron climbing hook  \n \n \nShikomizue, a cane sword  \n \n \nMakibishi, iron caltrops  \n \n \nBo-shuriken, throwing darts  \n \n \nBo-shuriken, with linen flights  \n \n \nChigiriki, chain and weight weapons  \n \n \nKusarigama, a chain and sickle  \n \n \nKusari-fundo, a chain weapon  \n \n \nVarious concealable weapons  \n \n \nChain mail shirt (Kusari katabira)   \n\nSee also \n \nJapan portal \n\nKhevtuul \nKunoichi \nModern schools of ninjutsu \nNinja Museum of Igaryu \nOrder of Musashi Shinobi Samurai \nPre-modern special forces \n\nNotes \n \n\n \n^ According to Imatani Akira, professor of Tsuru University, and Ishikawa Tadashi, assistant professor University of Central Florida, during Sengoku period a particularly dangerous groups called \"Ochimusha-gari\" or \"fallen warrior hunter\" groups has emerged. these groups were disenfranchised peasant or Rōnin who has been displaced by war. They formed self-defense forces which operates outside the law, while in actuality they often resorted to hunt samurais or soldiers who has been defeated in wars.[29][30][31]   \n\nReferences \n\nCitations \n \n\n \n^ Wells, John, ed. (2008). Longman Pronunciation Dictionary (3rd ed.). Pearson Longman. ISBN 978-1-4058-8118-0.  \n^ a b NHK Broadcasting Culture Research Institute, ed. (24 May 2016). NHK日本語発音アクセント新辞典 (in Japanese). NHK Publishing.  \n^ a b Turnbull, Stephen (30 November 2017). Ninja: Unmasking the Myth. Pen and Sword. ISBN 9781473850439.  \n^ Kawakami, pp. 21–22  \n^ Crowdy 2006, p. 50  \n^ Frederic 2002, p. 715  \n^ Mind of the Ninja exploring the inner power, Kirtland C. Peterson forwarded by Stephen K. Heyes (1986)  \n^ a b Green 2001, p. 355  \n^ Green 2001, p. 358; based on different readings, Ninpiden is also known as Shinobi Hiden, and Bansenshukai can also be Mansenshukai.  \n^ Origin of word Ninja Archived 2011-05-02 at the Wayback Machine.  \n^ Takagi, Gomi & Ōno 1962, p. 191; the full poem is \"Yorozu yo ni / Kokoro ha tokete / Waga seko ga / Tsumishi te mitsutsu / Shinobi kanetsumo\".  \n^ Satake et al. 2003, p. 108; the Man'yōgana used for \"shinobi\" is 志乃備, its meaning and characters are unrelated to the later mercenary shinobi.  \n^ a b c 吉丸雄哉(associate professor of Mie University) (April 2017). \"くのいちとは何か\". In 吉丸雄哉、山田雄司 編 (ed.). 忍者の誕生. 勉誠出版. ISBN 978-4-585-22151-7.  \n^ Oxford English Dictionary, 2nd ed.; American Heritage Dictionary, 4th ed.; Dictionary.com Unabridged (v 1.1).  \n^ Axelrod, Alan (2015). Mercenaries: A Guide to Private Armies and Private Military Companies. Washington, D.C.: CQ Press. ISBN 978-1-4833-6467-4.  \n^ 甲賀で忍術書の原典発見 番犬に吠えられない呪術も「間林清陽」48カ条 (in Japanese). Sankei Shimbun. 19 June 2022. Archived from the original on 20 June 2022.  \n^ 忍者の里 甲賀市で忍術書の基となった書の写本初めて見つかる (in Japanese). NHK. 19 June 2022. Archived from the original on 19 June 2022.  \n^ a b Waterhouse 1996, pp. 34  \n^ Chamberlain 2005, pp. 249–253; Volume 2, section 80  \n^ Ratti & Westbrook 1991, p. 325  \n^ Friday 2007, pp. 58–60  \n^ Ratti & Westbrook 1991, p. 324  \n^ a b Ratti & Westbrook 1991, p. 327  \n^ a b Draeger & Smith 1981, p. 121  \n^ Deal 2007, p. 165  \n^ Nakagawa, Takaaki (2015). Lecture No. 4: \"The Samurai Powers in the Kinai (Capital Region) and Iga\" – (2nd term). Conference with the Cooperation of Iga on Ninja Culture. Mie University.; Kenji, Kasai (2012). Lecture No.2: Activities of Igashu in the Sengoku Period. Conference with the Cooperation of Iga on Ninja Culture. Mie University. What we can conclude from the writing is that it was already well-known among people in the end of Sengoku period that sneaking and making night attacks were Ninja's favorite tactics.  \n^ Green 2001, p. 357  \n^ a b Adams 1970, p. 43  \n^ Fujiki Hisashi (2005). 刀狩り: 武器を封印した民衆 (in Japanese). 岩波書店. p. 29･30. ISBN 4004309654. Kunio Yanagita \"History of Japanese Farmers\"  \n^ Kirino Sakuto (2001). 真説本能寺 (学研M文庫 R き 2-2) (in Japanese). 学研プラス. pp. 218–9. ISBN 4059010421. Tadashi Ishikawa quote  \n^ Akira Imatani (1993). 天皇と天下人. 新人物往来社. pp. 152–153, 157–158, ､167. ISBN 4404020732. Akira Imatani\"Practice of attacking fallen warriors\"; 2000; p.153 chapter 4  \n^ Mitsuhisa Takayanagi (1958). 戦国戦記本能寺の変・山崎の戦 (1958年) (in Japanese). 春秋社. p. 65. Retrieved 9 May 2024. Luís Fróis;History of Japan..; Nihon Yoso-kai Annual Report\", Japanese historical materials also show that Ieyasu distributed a large amount of gold and silver to his subordinates) A certain \" Ishikawa Tadashi Sosho  \n^ 藤田達生 (2005). \"「神君伊賀越え」再考\". 愛知県史研究. 9. 愛知県: 1–15. doi:10.24707/aichikenshikenkyu.9.0_1.  \n^ Masahiko Iwasawa (1968). \"(Editorial) Regarding the original of Ietada's diary\" (PDF). 東京大学史料編纂所報第２号. Retrieved 16 November 2022.  \n^ Morimoto Masahiro (1999). 家康家臣の戦と日常 松平家忠日記をよむ (角川ソフィア文庫) Kindle Edition. KADOKAWA. Retrieved 10 May 2024.  \n^ Nakayama 2015. sfn error: no target: CITEREFNakayama2015 (help)  \n^ Yuji Yamada (2017). THE NINJA BOOK: The New Mansenshukai. Translated by Atsuko Oda. Mie University Facultyof Humanities, Law and Economics. Retrieved 11 May 2024.  \n^ Oishi, Gaku (2020). 江戸五百藩-ご当地藩のすべてがわかる. Chuokoron-Shinsha. ISBN 978-4128001354.(in Japanese)  \n^ a b Kenji Fukui (2018, p. 165) harvtxt error: no target: CITEREFKenji_Fukui2018 (help)  \n^ a b 254: 藤堂藩を裏で支えた無足人 (in Japanese). Rekishi Kaido Promotional Council. Retrieved 11 May 2024.  \n^ Iwata Nishizawa (1917, p. 695) harvtxt error: no target: CITEREFIwata_Nishizawa1917 (help)  \n^ Turnbull 2003, p. 51  \n^ Morton & Olenik 2004, p. 122  \n^ Crowdy 2006, p. 52  \n^ Yamada 2019, pp. 176–177  \n^ Yamada 2019, pp. 188–189  \n^ a b \"嬉野に忍者３人いた！ 江戸初期－幕末 市が委託調査氏名も特定\". Archived from the original on 20 August 2018. Retrieved 20 August 2018.  \n^ Yamada 2019, pp. 174–175  \n^ Yamada 2019, pp. 178–179  \n^ Yamada 2019, p. 180  \n^ Yamada 2019, p. 176  \n^ a b Kamm, Björn-Ole (2022). \"Reenacting Japan's Past That Never Was: The Ninja in Tourism and Larp\". Reenactment Case Studies: Global Perspectives on Experiential History: 146–170. doi:10.4324/9780429445668-10. Retrieved 7 March 2023.  \n^ a b c d e f g Owen Jarus (14 February 2022). \"430-year-old ninja weapons possibly identified\". Live Science. Archived from the original on 11 March 2022.  \n^ \"Japan university awards first-ever ninja studies degree\". France 24. 26 June 2020. Retrieved 3 May 2025.  \n^ \"Japan university to set up ninja research facilities\". Telangana Today. 11 May 2017. Archived from the original on 26 June 2020. Retrieved 26 June 2020.  \n^ a b c d \"Copy of legendary book on art of ninja found at shrine in west Japan city\". Mainichi Daily News. 21 June 2022. Archived from the original on 21 June 2022.  \n^ Casey Baseel (27 June 2022). \"First copy of centuries-old ninja training manual discovered, doesn't understand dogs\". Soranews 24. Archived from the original on 28 June 2022.  \n^ Draeger & Smith 1981, pp. 128–129  \n^ Fiévé & Waley 2003, p. 116  \n^ a b \"嬉野忍者調査結果 弁慶夢想 （べんけいむそう） 【武術家・山伏 / 江戸時代初期】\". Archived from the original on 14 February 2019. Retrieved 20 August 2018.  \n^ McCullough 2004, p. 49  \n^ 熊若 忍者名鑑  \n^ Adams 1970, p. 34  \n^ Adams 1970, p. 160  \n^ Adams 1970, p. 42  \n^ Turnbull 2003, p. 14   \n\nSources \n \n\nAdams, Andrew (1970), Ninja: The Invisible Assassins, Black Belt Communications, ISBN 978-0-89750-030-2 \nBuckley, Sandra (2002), Encyclopedia of contemporary Japanese culture, Taylor & Francis, ISBN 978-0-415-14344-8 \nBunch, Bryan H.; Hellemans, Alexander (2004), The history of science and technology: a browser's guide to the great discoveries, inventions, and the people who made them, from the dawn of time to today, Houghton Mifflin Harcourt, ISBN 978-0-618-22123-3 \nChamberlain, Basil Hall (2005), The Kojiki: records of ancient matters, Tuttle Publishing, ISBN 978-0-8048-3675-3 \nCrowdy, Terry (2006), The enemy within: a history of espionage, Osprey Publishing, ISBN 978-1-84176-933-2 \nDeal, William E. (2007), Handbook to Life in Medieval and Early Modern Japan, Oxford University Press, ISBN 978-0-19-533126-4 \nDraeger, Donn F.; Smith, Robert W. (1981), Comprehensive Asian fighting arts, Kodansha, ISBN 978-0-87011-436-6 \nFiévé, Nicolas; Waley, Paul (2003), Japanese capitals in historical perspective: place, power and memory in Kyoto, Edo and Tokyo, Routledge, ISBN 978-0-7007-1409-4 \nFriday, Karl F. (2007), The first samurai: the life and legend of the warrior rebel, Taira Masakado, Wiley, ISBN 978-0-471-76082-5 \nHowell, Anthony (1999), The analysis of performance art: a guide to its theory and practice, Routledge, ISBN 978-90-5755-085-0 \nGreen, Thomas A. (2001), Martial arts of the world: an encyclopedia, Volume 2: Ninjutsu, ABC-CLIO, ISBN 978-1-57607-150-2 \nKawaguchi, Sunao (2008), Super Ninja Retsuden, PHP Research Institute, ISBN 978-4-569-67073-7 \nKawakami, Jin'ichi (2016), Ninja no okite, Kadokawa, ISBN 978-4-04-082106-1 \nMcCullough, Helen Craig (2004), The Taiheiki: A Chronicle of Medieval Japan, Tuttle Publishing, ISBN 978-0-8048-3538-1 \nMol, Serge (2003), Classical weaponry of Japan: special weapons and tactics of the martial arts, Kodansha, ISBN 978-4-7700-2941-6 \nMorton, William Scott; Olenik, J. Kenneth (2004), Japan: its history and culture, fourth edition, McGraw-Hill Professional, ISBN 978-0-07-141280-3 \nNihon Hakugaku Kurabu (2006), Unsolved Mysteries of Japanese History, PHP Research Institute, ISBN 978-4-569-65652-6 \nNihon Hakugaku Kurabu (2004), Zuketsu Rekishi no Igai na Ketsumatsu, PHP Research Institute, ISBN 978-4-569-64061-7 \nPerkins, Dorothy (1991), Encyclopedia of Japan: Japanese History and Culture, from Abacus to Zori, Facts on File, ISBN 978-0-8160-1934-2 \nRatti, Oscar; Westbrook, Adele (1991), Secrets of the samurai: a survey of the martial arts of feudal Japan, Tuttle Publishing, ISBN 978-0-8048-1684-7 \nReed, Edward James (1880), Japan: its history, traditions, and religions: With the narrative of a visit in 1879, Volume 2, John Murray, OCLC 1309476 \nSatake, Akihiro; Yasumada, Hideo; Kudō, Rikio; Ōtani, Masao; Yamazaki, Yoshiyuki (2003), Shin Nihon Koten Bungaku Taikei: Man'yōshū Volume 4, Iwanami Shoten, ISBN 4-00-240004-2 \nTakagi, Ichinosuke; Gomi, Tomohide; Ōno, Susumu (1962), Nihon Koten Bungaku Taikei: Man'yōshū Volume 4, Iwanami Shoten, ISBN 4-00-060007-9 {{citation}}: ISBN / Date incompatibility (help) \nTatsuya, Tsuji (1991), John Whitney Hall (ed.), The Cambridge history of Japan, vol. 4: Early Modern Japan, translated by Harold Bolitho, New York: Cambridge University Press, ISBN 978-0-521-22355-3 \nTeeuwen, Mark; Rambelli, Fabio (2002), Buddhas and kami in Japan: honji suijaku as a combinatory paradigm, RoutledgeCurzon, ISBN 978-0-415-29747-9 \nTurnbull, Stephen (2003), Ninja AD 1460–1650, Osprey Publishing, ISBN 978-1-84176-525-9 \nTurnbull, Stephen (2007), Warriors of Medieval Japan, Osprey Publishing, ISBN 978-1-84603-220-2 \nWaterhouse, David (1996), Peter F. Kornicki; James McMullen (eds.), Religion in Japan: arrows to heaven and earth, article 1: Notes on the kuji, Cambridge University Press, ISBN 978-0-521-55028-4 \nYamada, Yūji (2019), Yōko Ymda (ed.), Sengoku Shinobi no Sahō, Chiyoda,Tokyo: G.B., ISBN 978-4-906993-76-5 \nFrederic, Louis (2002), Japan Encyclopedia, Belknap Harvard, ISBN 0-674-01753-6  \n\nFurther reading \n \n\nFujibayashi, Masatake; Nakajima, Atsumi (1996). Shōninki: Ninjutsu densho. Tokyo: Shinjinbutsu Ōraisha. OCLC 222455224. \nFujita, Seiko (2004). Saigo no Ninja Dorondoron. Tokyo: Shinpūsha. ISBN 978-4-7974-9488-4. \nFukai, Masaumi (1992). Edojō oniwaban: Tokugawa Shōgun no mimi to me. Tokyo: Chūō Kōronsha. ISBN 978-4-12-101073-5. \nHokinoichi, Hanawa (1923–1933). Buke Myōmokushō. Tokyo: Yoshikawa Kōbunkan. OCLC 42921561. \nIshikawa, Masatomo (1982). Shinobi no sato no kiroku. Tokyo: Suiyōsha. ISBN 978-4-88066-110-0. \nMol, Serge (2008). Invisible Armor: An Introduction to the Esoteric Dimension of Japan's Classical Warrior Arts. Eibusha. ISBN 978-90-813361-0-9. \nMol, Serge (2016). Takeda Shinobi Hiden: Unveiling Takeda Shingen's Secret Ninja Legacy. Eibusha. ISBN 978-90-813361-3-0. \nNawa. Yumio (1967). Shinobi no buki. Tokyo: Jinbutsu Ōraisha. OCLC 22358689. \nNawa, Yumio (1972). Hisshō no heihō ninjutsu no kenkyū: gendai o ikinuku michi. Tokyo: Nichibō Shuppansha. OCLC 122985441. \nOkuse, Heishichirō (1964). Ninpō: sono hiden to jitsurei. Tokyo: Jinbutsu Ōraisha. OCLC 51008989. \nOkuse, Heishichirō (1967). Ninjutsu: sono rekishi to ninja. Tokyo: Jinbutsu Ōraisha. OCLC 22727254. \nTurnbull, Stephen (2017). Ninja: Unmasking the Myth. Barnsley, S. Yorkshire, UK: Frontline Books. ISBN 978-1-4738-5042-2. \nWatatani, Kiyoshi (1972). Bugei ryūha hyakusen. Tokyo: Akita Shoten. OCLC 66598671. \nYamaguchi, Masayuki (1968). Ninja no seikatsu. Tokyo: Yūzankaku. OCLC 20045825.  \n\nExternal links \n \n \n \nWikimedia Commons has media related to Ninja.  \n\nNinja magazine \n\n\n\n\nv\nt\ne\nJapanese weapons, armour and equipmentSwords\n\n \n\nChokutō \nDōtanuki \nGuntō \nKatana \nKodachi \nNagamaki \nNinjatō \nŌdachi \nShikomizue \nTachi \nTantō \nTsurugi \nWakizashi Construction\n \n\nGlossary \nHorimono \nSword mountings \nSword polishing \nSwordsmithing \nTameshigiri \nKnives and daggers\n \n\nKabutowari \nKaiken \nKunai \nYoroi-dōshi Polearms and spears\n \n\nBisento \nHoko yari \nKama-yari \nNaginata \nSasumata \nSodegarami \nTorimono sandōgu \nTsukubō \nYari Practice weapons\n \n\nBokken \nIaitō \nShinai \nShinken \nSuburitō \nTanren bō Armour\n\n \n\nAuxiliary armours \nBōgu \nDō \nDō-maru \nHaramaki \nKabuto \nKaruta \nKikko \nKusari \nMen-yoroi \nŌ-yoroi \nSangu \nTatami Types\n \n\nBrigandine \nLame \nLamellar \nLaminar \nMail \nPlate \nMail and plate armour \nScale \nClothing\n \n\nFundoshi \nHachimaki \nHakama \nKyahan \nShitagi \nTabi \nUwa-obi \nWaraji Samurai accoutrements\n \n\nAbumi \nDaishō \nHoro \nKaginawa \nKate-bukuro \nKubi bukuro \nKura \nUchi-bukuro \nYebira Chain and rope weapons\n \n\nChigiriki \nKubotan \nKusarigama \nKusari-fundo \nKyoketsu-shoge \nJōhyō Clubs and truncheons\n \n\nHachiwari \nJitte \nKanabō \nTekkan \nTessen Staff weapons\n \n\nBō \nHanbō \nJō \nTanbō \nYubi-bo Projectile and throwing weapons\n \n\nArtillery \nFukiya \nMakibishi \nOyumi \nShuriken \nYa \nYumi Firearms and guns\n \n\nBajō-zutsu \nBo-hiya \nŌdzutsu \nTanegashima Improvised and other weapons\n \n\nKama \nKiseru \nMetsubushi \nOno \nŌtsuchi \nShobo \nSuntetsu Signal devices\n \n\nGunbai \nHata-jirushi \nHoragai \nKabura-ya \nNobori \nSaihai \nSashimono \nUma-jirushi Users\n \n\nAshigaru \nEdo period police \nKunoichi \nNinja \nOnna-musha \nRōnin \nSamurai \nShinsengumi \nSōhei \nYabusame \nYamabushi \n \n\nJapanese armour \nWeapons of Japan \nJapanese swords \nNational Treasure swords \nMilitary equipment of Japan  \n\nAuthority control databases: National \n\n\nJapan\nCzech Republic\nIsrael     \nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Ninja&oldid=1289530776\" \n\nCategories: \n\nNinja\nCombat occupations\nJapanese warriors\nJapanese words and phrases\nMercenary units and formations\nObsolete occupations\nPre-modern special forces\nHidden categories: \n\nCS1 uses Japanese-language script (ja)\nCS1 Japanese-language sources (ja)\nWebarchive template wayback links\nHarv and Sfn no-target errors\nArticles with Japanese-language sources (ja)\nArticles with short description\nShort description is different from Wikidata\nWikipedia indefinitely semi-protected pages\nUse dmy dates from February 2020\nArticles containing Japanese-language text\nPages with Japanese IPA\nPages using multiple image with auto scaled images\nCS1 errors: ISBN date\nCS1: long volume value\nCommons category link from Wikidata    \n \n \n \n This page was last edited on 9 May 2025, at 06:25 (UTC). \nText is available under the Creative Commons Attribution-ShareAlike 4.0 License; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.  \n \nPrivacy policy \nAbout Wikipedia \nDisclaimers \nContact Wikipedia \nCode of Conduct \nDevelopers \nStatistics \nCookie statement \nMobile view  \n \n \n      \n \n \n \n \n Search   \n \n \n \n \n \n      \nSearch     \n  \n   Toggle the table of contents  \n \n     \nNinja   \n \n                       \n \n 79 languages   Add topic\n"
}