{
  "https://vocal.media/fiction/insane-life-of-an-egyptian-pharaoh": "Title: Insane Life of an Egyptian Pharaoh\n\nURL Source: https://vocal.media/fiction/insane-life-of-an-egyptian-pharaoh\n\nMarkdown Content:\nAnother day dawns in Ancient Egypt, and a man gets up to greet the day. He has family, responsibilities, and pleasures waiting for him in the day ahead, just like everyone else. But he’s no ordinary man. He’s the Pharaoh, the ruler of the Egyptian empire. So what was it like to be one of the most powerful men in the world?\n\nIt was very different from being an ordinary citizen of Egypt - and in some ways, not different at all. From the moment the pharaoh wakes up in the morning, they’re not alone. That’s because one of the defining characteristics of being the king was being surrounded at all times by loyal servants. It wouldn’t do to have the king and his family tackle the dirty tasks of day-to-day living by themselves, would it? So the royal palace is staffed by countless servants who each play their role in keeping the place running. The Pharaoh has help getting dressed, has someone preparing his meals for him, and has someone to bring him anything he wants throughout the day - it’s as if he has a classic butler staff, but times a hundred. And he’s not the only one who has helped?\n\nThe Pharaoh’s family is also surrounded by servants. The Queen has her staff, usually made up of women, to tend to her needs, while the kids are assigned royal nannies and tutors to guide them as they age. After all, dad has an empire to run. And with a staff this big, you can’t expect the Pharaoh to run the whole operation - the palace would usually employ a Royal Controller who is essentially the boss of the servants. They would keep track of them, assign them to roles, and ensure their performance was up to par - so bad news doesn’t get back to the boss.\n\nBut the servants don’t just stay in the palace. When the pharaoh leaves the palace, he’s usually escorted by a team of servants as well. Some might be responsible for carrying the pharaoh’s litter or guiding the horses driving him in a chariot. Others would have an even more important duty - guarding the pharaoh’s life! These bodyguards were among the most highly-trained members of the servant class, often dedicating their life to sharpening their combat skills. Other strong servants might be tasked with maintaining the palace, taking the lead on construction projects and working the royal fields. But were these servants…or something else? It’s commonly portrayed in media that ancient Egypt was run by slaves, both residents of Egypt and foreign slaves who were captured.\n\nBut in actuality, most of Egypt’s workforce - including those who built the pyramids - were paid, servants. That didn’t mean they were free, once you worked for the King, there wasn’t any way to quit and you were pretty much stuck in the servant social class. But servants weren’t without rights - their children could move up in the social order, and trusted servants were often valued members of the Pharaoh’s household. And there was a lot for these servants to keep track of - because the Pharaohs lived opulent lives. For the pharaohs, getting dressed was not a quick process - for most peasants, they would put on a simple garment and be ready for a day of labour. The pharaohs, however, dressed to impress.\n\nThat meant they would likely spend a good deal of time in the morning getting their regalia in order with the help of their servants. One of the most common pieces of gear a pharaoh would wear was animal skin, often of a large predator like a leopard or lion. This was supposed to show that the pharaoh feared no beast - although it was likely that the Pharaoh never got close to the source of that pelt. And that wasn’t the only way the Pharaoh would try to impress.\n\nThe headdress was one of the most important parts of the Pharaoh’s regalia, with some wearing a specially designed cloth known as a nemes. These striped cloths usually had a one-of-a-kind pattern weaved by one of Pharaoh’s trusted seamstresses. Others would wear an impressive crown, often adorned with jewels and precious metals. These could be heavy - but it wasn’t like the Pharaoh was going to be doing hard labour while wearing it! The main job of the Pharaoh on a day-to-day schedule was to serve as an imposing figure and pass judgment based on the advice he was given. But that’s all it was - advice. Was the Pharaoh truly an absolute monarch? In a word - yes! During the days when Egypt was an independent empire, the Pharaoh was not only the king - he was generally considered an avatar of the Gods and was trusted with power over life and death. His word was absolute, and angering the Pharaoh could mean death. But at the same time, he was largely disconnected from the the world around him.\n\nHe spent most of his time in the palace, learned about the affairs of the common people from his advisors, and his decisions were likely heavily influenced by their perspective - which meant his most trusted advisors might have been the ones pulling the strings. But that doesn’t mean the Pharaoh couldn’t make huge changes. Under most eras of ancient Egypt, the people followed a polytheistic faith that worshipped a pantheon of Gods led by the mighty Osiris. But under the Pharaoh Akhenaten, it was deemed that the state religion would change to a mostly monotheistic one worshipping only the sun god Aten - who happened to be the pharaoh’s namesake. It didn’t catch on, but the public had no choice but to largely comply during his lifetime, at least publicly.\n\nBut one absolute monarch can just as easily reverse another’s decision. His son - King Tutankhamun, the boy king - almost immediately chose to restore the old religion. And being an absolute monarch can mean major risks. While things largely worked out with the boy king Tut, there was still a preteen on the throne suddenly - and that could have gone very badly. Fortunately, he was heavily influenced by his advisors and his reign was mostly inconsequential. But while Egypt didn’t have too many mad kings that we know of - unlike Rome’s infamous Nero and Caligula - all it would have taken was one hereditary monarch who didn’t want to listen to his advisors and kept on making bad decisions for things to go south in a hurry. Of course, the advisors and military leaders tended to take over after Pharaohs died suddenly, so maybe they were just stepping in before things went too badly. And for future Pharaohs, the training began early.\n\nWhat was it like being a child royal? In a word - pretty great! While Egyptian children as a whole had a better quality of life than children in many other countries, thanks to Egypt’s wealth, they still weren’t exactly living the comfortable life many children experience today. Commoner children would likely be working in their parents’ trade from a young age. Royal children, though, lived in the lap of luxury. While any sort of long-term public education was a rarity for commoners, the royals typically had tutors working for them. They would typically be accompanied by minders from a young age, but how involved the Pharaoh was in their upbringing would vary. It wasn’t uncommon for a crown prince to be given responsibilities in his father’s court to teach him the way of the world.\n\nBut for most Egyptian royal children, it was likely a life of leisure. Studies of Ancient Egyptian artefacts have found evidence of childhood toys and games, including board games that resemble the ones still played today. It’s likely these children had the run of the palace when they weren’t in lessons or being supervised by their parents. Evidence shows that the Ancient Egyptians - commoners and royals alike - greatly valued their children and stayed involved in their upbringing. However, there is no question that royal children likely had a lot more fun on a day-to-day basis than their commoner counterparts! And having the run of the palace meant quite a lot of opportunity. Egypt was the largest and most powerful empire in the world at the time - and it wouldn’t do for a mighty Pharaoh to live in a palace that didn’t reflect that. While the most impressive structures in Egypt were undoubtedly the pyramids at the Giza Necropolis, there’s no question that the Egyptian palaces we’ve learned about were among the most impressive ever constructed.\n\nThe best-known one is Malkata, the New Kingdom palace of Amenhotep III. Located on the bank of the Nile in Thebes, it was mostly built out of mud brick and is estimated to have taken eighteen years to complete. It was the largest royal residence ever constructed in Egypt. And they made good use of that space. Among the many features in the palace was a large artificial lake connected to the Nile through a series of canals. This eliminated the need to bring fresh water to the palace manually. The palace was filled with multiple halls, villas, courtyards, and smaller palaces and apartments for the associates of the Pharaoh. And the Pharaoh’s private quarters were almost a palace in itself - with four rooms, including a bedroom, a dressing room, and even a harem’s quarters.\n\nA massive temple dedicated to his wife and honouring the crocodile God Sobek was on the grounds as well. But time had its way with even this mighty palace. Today, little remains of Amenhotep III’s glorious palace are beside the foundations, but they’re enough to create an impressive visual of just how big this palace is. There’s no question that the Pharaoh and his family lived in luxury, with a sprawling palace complete with a massive dining room where they would eat… Wait, what did they eat exactly? The food of ancient Egypt was a very different beast than today’s cuisine. Few modern cooking implements existed, and all food was sourced locally. But the food of the pharaohs was still very different from that of the commoners. Commoners didn’t have access to many of the luxury goods - but surprisingly, the staples of both were the same, and they both came down to the same crop. Wheat, the largest crop of ancient Egypt, was the stuff of life. The base of meals for all people was bread and beer.\n\nThe bread was typically made from emmer wheat, while the beer was typically cloudy with plenty of unsifted solids. As such, it was more like alcoholic gruel than the Miller Light we all know. But that’s where the similarities ended. Fruits and vegetables were also served to the Pharaoh, with the most common local crops being garlic and scallions. That’ll add a pop of flavour, but it’s not exactly going to fill you up. The availability of other crops like lettuce, celery, cucumber and gourds as well as fruits like dates, figs, and raisins were varied.\n\nThese were typically considered luxury crops, although the working class might be able to get ahold of some when there was a surplus. The fruits would often be dried to preserve them for longer - and the pharaohs would usually have access to them throughout the year. But where’s the beef? The Egyptians were fairly advanced in domesticating animals, and they raised cattle, sheep, goats, and pigs. They also hunted birds and fished in the rivers, giving them an ample supply of meat. Only the poorest didn’t have access to any animal protein, usually subsisting on legumes instead. But hunting and raising animals was a time-consuming process, and subsistence farmers often didn’t have the time for it.\n\nWhile the meat on the table would be modest for them, it would be anything but for the pharaohs. There is evidence of the ancient Egyptians raising massive numbers of oxen - with the workers building the Great Pyramid being served beef every day. And for the Pharaohs, life was likely a never-ending buffet. The Pharaohs had the resources to raise large numbers of domesticated animals, and if they wanted a specific meal they could always send their servants out to hunt for it. That meant the table was usually filled with wild birds, beef, mutton, pork, fish, and anything else they could get their hands on. This was also the era when one of the most famous delicacies in the world was invented - Foie Gras. This deliberately fattened goose liver was developed back in the 25th century BCE. They were also fond of eating a much smaller bird - the sparrow, which reportedly had aphrodisiac properties! And the Pharaoh would build up a big appetite - because he was pretty busy all day.\n\nThe day would start with him being dressed and cleaned by his servants, including anointing him with scented oils. Once he was wearing all his robes and jewels, he would go to the audience chamber. There he would face his daily meetings - but don’t worry, they would be flattering. After all, he is a king who is also considered a god, and those in the meetings are a combination of commoners, noblemen, and visiting dignitaries. The odds are every single one of them would bow before him as they enter, often presenting him with offerings. The only ones who do not seem to show this level of intense devotion are his everyday advisors, but even they would probably bow to the Pharaoh. But even the pharaoh answers to someone. After the daily audiences, the Pharaoh would likely go to the temple to pay his tribute to the Gods.\n\nMaking the daily offerings with the assistance of the high priest is a time of quiet devotion - but it’s not just religion that guides him to do this. He is also seen as the shepherd of the country, and if it was to descend into chaos under him he could be ousted in a coup - potentially even by his military leaders or advisors. So dutifully, he talks to the statues of the Gods and then sacrifices cattle to them with the help of the royal butcher. It’s a private affair for the pharaoh, only accompanied by a few trusted people, and it’s a rare moment of quiet reflection for the man who rules all of Egypt. But then it’s time for the Pharaoh to leave the palace. Today, little remains of Amenhotep III’s glorious palace beside the foundations, but they’re enough to create an impressive visual of just how big this palace is. There’s no question that the Pharaoh and his family lived in luxury, with a sprawling palace complete with a massive dining room where they would eat… Wait, what did they eat exactly? The food of ancient Egypt was a very different beast than today’s cuisine. Few modern cooking implements existed, and all food was sourced locally. But the food of the pharaohs was still very different from that of the commoners.\n\nCommoners didn’t have access to many of the luxury goods - but surprisingly, the staples of both were the same, and they both came down to the same crop. Wheat, the largest crop of ancient Egypt, was the stuff of life. The base of meals for all people was bread and beer. The bread was typically made from emmer wheat, while the beer was typically cloudy with plenty of unsifted solids. As such, it was more like alcoholic gruel than the Miller Light we all know. But that’s where the similarities ended. Fruits and vegetables were also served to the Pharaoh, with the most common local crops being garlic and scallions. That’ll add a pop of flavour, but it’s not exactly going to fill you up. The availability of other crops like lettuce, celery, cucumber and gourds as well as fruits like dates, figs, and raisins were varied. These were typically considered luxury crops, although the working class might be able to get ahold of some when there was a surplus. The fruits would often be dried to preserve them for longer - and the pharaohs would usually have access to them throughout the year. But where’s the beef?\n\nThe Egyptians were fairly advanced in domesticating animals, and they raised cattle, sheep, goats, and pigs. They also hunted birds and fished in the rivers, giving them an ample supply of meat. Only the poorest didn’t have access to any animal protein, usually subsisting on legumes instead. But hunting and raising animals was a time-consuming process, and subsistence farmers often didn’t have the time for it. While the meat on the table would be modest for them, it would be anything but for the pharaohs. There is evidence of the ancient Egyptians raising massive numbers of oxen - with the workers building the Great Pyramid being served beef every day. And for the Pharaohs, life was likely a never-ending buffet. The Pharaohs had the resources to raise large numbers of domesticated animals, and if they wanted a specific meal they could always send their servants out to hunt for it. That meant the table was usually filled with wild birds, beef, mutton, pork, fish, and anything else they could get their hands on. This was also the era when one of the most famous delicacies in the world was invented - Foie Gras. This deliberately fattened goose liver was developed back in the 25th century BCE. They were also fond of eating a much smaller bird - the sparrow, which reportedly had aphrodisiac properties! And the Pharaoh would build up a big appetite - because he was pretty busy all day. The day would start with him being dressed and cleaned by his servants, including anointing him with scented oils.\n\nOnce he was wearing all his robes and jewels, he would go to the audience chamber. There he would face his daily meetings - but don’t worry, they would be flattering. After all, he is a king who is also considered a god, and those in the meetings are a combination of commoners, noblemen, and visiting dignitaries. The odds are every single one of them would bow before him as they enter, often presenting him with offerings. The only ones who do not seem to show this level of intense devotion are his everyday advisors, but even they would probably bow to the Pharaoh. But even the pharaoh answers to someone. After the daily audiences, the Pharaoh would likely go to the temple to pay his tribute to the Gods. Making the daily offerings with the assistance of the high priest is a time of quiet devotion - but it’s not just religion that guides him to do this. He is also seen as the shepherd of the country, and if it was to descend into chaos under him he could be ousted in a coup - potentially even by his military leaders or advisors. So dutifully, he talks to the statues of the Gods and then sacrifices cattle to them with the help of the royal butcher.\n\nIt’s a private affair for the pharaoh, only accompanied by a few trusted people, and it’s a rare moment of quiet reflection for the man who rules all of Egypt. But then it’s time for the Pharaoh to leave the palace. You can’t carry out all the royal duties from the safety of the palace - and what would be the fun in that? So it’s time to head out on the daily errands - but the Pharaoh isn’t going to be walking on his own two feet. That would be undignified, and it would also be risky. So he’s likely going to pick between two main forms of transportation. The first is the traditional horse-drawn chariot - very useful when you need to go fast. Many Pharaohs liked to use the chariots for recreation as well - using them to hunt or to race other chariots. Or he could go under foot power - but not his own.\n\nThe Royal Litter is a device used for thousands of years, and it’s as simple as can be - a small chamber containing a comfortable seat for his royal majesty, attached to several poles that will be carried by trusted servants. A small litter might be transported only by two people holding on to two poles, but larger ones - like those fit for a king - would likely be transported by four people at a time. This would be an ideal mode of transportation for a king out on local errands. So what would a king get up to on his daily errands? The pharaoh usually has a lot of different construction projects going on at one time, with each site being run by a royal foreman. He would regularly visit each site, getting a look at the progress and presenting any updates to the plans. He would also take general tours of the city to let the people see him - this is a useful way to build up the loyalty of the local population and keep them from becoming disconnected from the royal family.\n\nThis is the biggest event of the day, with many locals crowding around to catch sight of the man they view as an avatar of the Gods. And from there, it’s back to the palace for dinner and a relaxing night’s sleep. The Pharaoh seems to live a charmed life - but one area poses concerns. The pharaohs were powerful in almost every way - but they were also mortal. Many of them had surprisingly short reigns - including the famous King Tut, who was on the throne by age nine and deceased by age eighteen - likely from a combination of health conditions he was born with and injuries suffered in what might have been a chariot accident. While the pharaohs had access to better health care than the average Egyptian citizen, they also lacked access to modern medicine - because it largely hadn’t been invented yet! And that meant they were vulnerable to a whole host of conditions.\n\nThe Egyptians did have some surprisingly modern medical techniques, including minor surgeries to repair broken bones and sew up injuries, and they had access to several medicines, but one area they were lacking in was modern antibiotics. The Egyptian doctors did seem to understand the basic principles - while there was no understanding of concepts like bacteria back then, some ancient texts used fermented beer as a treatment for infections. It may have been better than nothing - but it wasn’t as effective as modern treatments, which meant there was always a risk that one minor cut could turn into a serious infection and end anyone’s life, even a king’s. And there was another major risk factor to being a pharaoh - and it started before they were even born. Who was worthy enough to marry a pharaoh? Well, not a commoner, and most lower-tier nobles probably don’t qualify either. We’ve got to keep it in the family - so Egyptian royal families were heavily inbred. It was common for kings to marry a sister, often a half-sister from one of the previous pharaoh’s other wives.\n\nThis reduced genetic inbreeding - but it was still common for pharaohs to be born with genetic conditions. King Tut was born with a club foot, scoliosis, and potentially a genetic condition like Marfan Syndrome that may have contributed to his early demise. But with pharaohs, death isn’t the end. Death was around the corner for everyone in ancient Egypt, and they were firm believers in an afterlife. So it was common for a pharaoh to begin planning for their death long before they were expecting it. One of the most important tasks of a pharaoh’s life was designing their tombstone - ranging from an impressive memorial palace to a magnificent giant pyramid that would hopefully still be standing thousands of years later. These tombs are among the most significant architectural achievements left from ancient Egypt. It might seem morbid to plan so thoroughly for your death - especially as a young king - but because the Egyptians had such a literal view of the afterlife, it was almost comforting. Death, no matter how or when it happened, was just the next step of the journey - and they wanted to be well-equipped. In addition to building their final resting place, they would often carefully pick what they would be taking to the grave with them. This often meant their most treasured possessions, plus a healthy supply of food just in case.\n\nDespite how often the media brings it up, sacrificing one’s servants to take with you to the afterlife was exceedingly rare - although animal sacrifices were very common. And when the Pharaoh passed on, history would repeat itself - kind of. The pharaoh’s day typically begins with his servants dressing him and preparing him for the day. And that would happen one last time after death - in a much more thorough manner. This time, they would be preparing him for mummification. This would include removing all the tissues filled with liquid that would be most likely to rot - including the brain and most of the internal organs, which would be preserved in canopic jars. The body would then be embalmed and placed in an ornate coffin where it would be laid to rest in the massive tomb that had been built - preserved in a mostly airtight chamber where it would remain surprisingly intact thousands of years later.\n\nAnd soon a new Pharaoh would take the throne - with a strict schedule and a huge team of servants to help him carry out the task of ruling the greatest empire of the ancient world.\n"
}