{
  "https://www.historyskills.com/classroom/ancient-history/anc-role-of-pharaoh-reading/?srsltid=AfmBOopJLuPJDBdTlyz6Q1i2UKrAyYZeYKph8gKWfipaWN7OeJvt-npQ": "Title: What were an Egyptian pharaoh's roles and responsibilities?\n\nURL Source: https://www.historyskills.com/classroom/ancient-history/anc-role-of-pharaoh-reading/?srsltid=AfmBOopJLuPJDBdTlyz6Q1i2UKrAyYZeYKph8gKWfipaWN7OeJvt-npQ\n\nMarkdown Content:\nWhat were an Egyptian pharaoh's roles and responsibilities? - History Skills\n===============\n\n*   Home\n    *   For Students\n    *   For Teachers\n    *   Studying History\n*   Historical Knowledge\n    *   Background Knowledge\n    *   Chronology\n    *   Change and Continuity\n    *   Causes and Consequences\n    *   Significance\n    *   Motives and Historical Empathy\n*   Researching\n    *   1\\. Key Question\n    *   2\\. Background Research\n    *   3\\. Sub-questions\n    *   4\\. Source Research\n    *   5\\. Organise Quotes\n    *   6\\. Topic Sentences\n    *   7\\. Hypothesis\n    *   8\\. Draft Writing\n    *   9\\. Final Draft\n    *   Rationale\n    *   Critical Summary\n*   Source Criticism\n    *   Comprehension\n    *   Interpretation\n        *   Written Sources\n        *   Photographs\n        *   Political Cartoons\n        *   Propaganda Posters\n    *   Analysis\n        *   Source Kind and Type\n        *   Source Creator\n        *   Time of Creation\n        *   Context\n        *   Audience\n        *   Purpose\n        *   Perspective\n        *   Bias\n        *   Corroboration\n        *   Contradiction\n    *   Evaluation\n        *   Usefulness\n        *   Accuracy\n        *   Reliability\n        *   Contestability\n    *   Incorporating Evaluation\n*   Quoting\n    *   Direct Quotes\n    *   Indirect Quotes\n*   Referencing\n    *   In-text Referencing\n    *   Appendices\n    *   Bibliographies\n*   Assessment\n    *   Written Essays\n    *   Essay Exams\n    *   Source Investigation\n    *   Response to Stimulus\n    *   Extended Response\n    *   Knowledge Exams\n    *   Multi-Modal Presentations\n*   Finding Sources\n    *   Ancient History\n        *   Ancient Egypt\n        *   Ancient Israel\n        *   Ancient Mesopotamia\n        *   Ancient Greece\n        *   Alexander the Great\n        *   Ancient Rome\n        *   Ancient China\n    *   Medieval History\n        *   Medieval Europe\n        *   Byzantium\n        *   Vikings\n        *   Feudal Japan\n        *   Renaissance and Reformation\n    *   Modern History\n        *   Industrial Revolution\n        *   Australian History\n        *   World War I\n        *   World War II\n        *   Israel-Palestine\n        *   Civil Rights\n        *   Vietnam War\n        *   Soviet Russia\n    *   Pre-Columbian American History\n        *   Aztecs\n        *   Maya\n        *   Inca\n*   Favourites\n    *   Podcasts\n    *   YouTube\n    *   Posters\n    *   Films\n    *   Online PD\n*   Blog\n*   About\n*   Contact\n*   Store\n*   Classroom\n    *   Modern History\n        *   France\n        *   America\n        *   Russia\n        *   Germany\n        *   India\n        *   Japan\n        *   Australia\n        *   Israel-Palestine\n    *   Ancient History\n        *   Archaeology\n        *   Ancient Egypt\n        *   Ancient Greece\n        *   Alexander\n        *   Ancient Rome\n        *   Early Middle Ages\n        *   The Crusades\n    *   Year 10\n        *   Inter-War Years\n        *   World War Two\n        *   Rights & Freedoms\n        *   Cold War\n        *   Popular Culture\n    *   Year 9\n        *   Birth of Modernity\n        *   Industrial Revolution\n        *   Australian History\n        *   World War One\n    *   Year 8\n        *   Dark Ages\n        *   Middle Ages\n        *   Tudors\n        *   Feudal Japan\n        *   Age of Exploration\n        *   Aztec\n        *   Inca\n        *   Reformation\n    *   Year 7\n        *   Archaeology\n        *   Ancient Australia\n        *   Egypt\n        *   Greece\n        *   Rome\n        *   China\n\n![Image 6](https://www.historyskills.com/)\n\n1.  Classroom\n2.  Ancient History\n\nWhat were an Egyptian pharaoh's roles and responsibilities?\n===========================================================\n\n\n\nSource: https://pixabay.com/photos/egypt-edfu-temple-engraving-3318551/\n\nThe king of ancient Egypt was known as the 'pharaoh' and whoever held this position had absolute authority in the kingdom.\n\nNot only was a pharaoh a political position, the ancient Egyptians believed that the pharaoh was also a living god on Earth.\n\nThis combination of political and religious elements in the pharaonic role meant that anyone who was pharaoh had many responsibilities to fulfil.\n\nUltimately, he was responsible for the well-being of his people and had to maintain a balance between the environment and the economy.\n\nIf they failed in these duties, a great disaster could fall upon Egypt.\n\n### The origins of the pharaoh\n\nThe origin of the word 'pharaoh' is not known for sure, but it is thought to have originated during the Old Kingdom period.\n\nThe title originally meant 'great house', which referred to the royal palace. It later came to mean 'king of Egypt'.\n\nHowever, the first known use of the title 'pharaoh' was in the 18th Dynasty, during the reign of Amenhotep III, and was commonly used to refer directly to the king of Egypt in the New Kingdom period, starting around 1550 BC.\n\nHowever, from the very first pharaoh in the Old Kingdom, the role quickly became of central importance in ancient Egyptian society.\n\nHe was the head of state, the military leader, the high priest of every temple, and the supreme judge.\n\nAt its core, the position pharaoh was also responsible for ensuring that the gods were happy.\n\nHowever, it must be mentioned that while most pharaohs were men, there were a number of famous female pharaohs who held this position as well.\n\n![Image 8: Statue of Ramses II at Abu Simbel](javascript:;)\n\nSource: https://pixabay.com/photos/travel-egypt-orange-pharaoh-945309/\n\n  \n\n### The pharaoh's role in Egypt's religion\n\nThe pharaoh was considered to be a living god on Earth, and as such, he had many responsibilities to both gods and humans.\n\nHe was responsible for maintaining balance in the universe and ensuring that Ma'at (a concept that meant something like \"order\", \"truth\", or \"justice\") prevailed.\n\nAs the high priest of every temple in Egypt, the pharaoh was responsible for performing rituals and offering sacrifices to the gods.\n\nIn doing so, he ensured that the gods were happy and that they would continue to provide for the people of Egypt.\n\nHowever, the pharaoh could not be personally present at every temple for every ceremony, so he appointed high priests to oversee the temples in his place.\n\nIn the temples across Egypt, there was a complex religious hierarchy with various ranks of priests and priestesses who performed daily rituals and tasks.\n\nMost of the time, the high priests, which were appointed by the pharaoh, were given significant freedom and power to carry out their religious duties.\n\nHowever, the pharaoh still had final say over all religious matters.\n\nAn example of this is the pharaoh Akhenaten, who controversially changed the religion of Egypt from polytheism to monotheism.\n\nThis dramatic change was not universally accepted, and this upset the priests of the other gods, as it meant that they would no longer have a job.\n\nAkhenaten was within his rights as pharaoh to make this change, however the old religious practices were restored after his death.\n\n![Image 9: Egyptian temple carving of a pharaoh on a throne](javascript:;)\n\nSource: https://pixabay.com/photos/egypt-abusimbel-mural-trip-temple-4862695/\n\n  \n\n### The pharaoh as a military conqueror\n\nAs the head of state, the pharaoh was responsible for leading Egypt in times of war.\n\nHe was expected to personally command the Egyptian army and lead them into battle.\n\nIf the pharaoh was victorious, he would return home as a hero, and his people would celebrate his achievements.\n\nThe pharaoh was also responsible for maintaining Egypt's borders. He did this by building fortifications along the Nile River, and by stationing troops at strategic points along the border.\n\nThis ensured that Egypt was safe from invaders.\n\nThe pharaoh also had to deal with problems at home, such as rebellions and civil unrest.\n\nHe was expected to do this by crushing any uprising quickly and harshly punishing its leaders.\n\nThutmose III exemplified this role of the pharaoh when he put down a rebellion in Syria.\n\nHe did this by leading his army into battle and defeating the rebels. This victory cemented his position as a strong and powerful ruler.\n\n  \n\n### Economy\n\nIn addition, the pharaoh was responsible for ensuring that the economy of ancient Egypt flourished.\n\nOne of the most important jobs was the maintenance of irrigation systems along the Nile.\n\nThese systems were crucial in successful agriculture, which was at the heart of the Egyptian economy.\n\nUnlike today, the Egyptians did not have a standard form of currency like coins.\n\nInstead, their economy was based upon the agricultural goods that farmers produced, whether it be grain, animals, or food products.\n\nFrom these products of his kingdom, the pharaoh was responsible for ensuring that taxes were collected.\n\nEach farmer was required to give up around 20% of all of their products to the pharaoh himself in taxes.\n\nThis was then used by the pharaoh to fund his own building projects and military campaigns.\n\nSuch projects provided employment for Egyptians and helped to boost the economy.\n\nThe king also controlled trade with other countries. The land of Egypt had few natural resources and, as a result, it relied heavily on imported goods for many valuable commodities.\n\nFor example, gold had to come from Nubia to the south, and wood had to be brought in from Syria to the north.\n\nEven rarer products like lapis lazuli came from afar away as modern Afghanistan.\n\nSo, the pharaoh was responsible for the safety of these important trade networks to meet the needs of his people.\n\n### The pharaoh as judge and enforcer of justice\n\nThe pharaoh was expected to be a fair and just ruler, who would listen to the concerns of his people and address them accordingly.\n\nAt a basic level, he was responsible for maintaining law and order within Egypt.\n\nTheoretically, legal disagreements could be sent to the pharaoh for resolution.\n\nHowever, in practice, only the wealthy elite were close enough to the king to take advantage of this.\n\nInstead, the pharaoh appointed judges and courts throughout the land so that the common people had an opportunity to have their concerns dealt with.\n\nAn orderly justice system reflected well on the pharaoh and was an important way of keeping the common people happy.\n\n  \n\n### The pharaoh's power of nature and the environment\n\nThe king of Egypt was also meant to ensured that the Nile River was not polluted, and that the lands around it were fertile.\n\nHe also had to protect Egypt from floods and droughts. The pharaoh's irrigation systems helped to prove the necessary water to the land, and his canals allowed for trade between different parts of Egypt.\n\nAs a god, it was believed that the pharaoh had control over the annual Nile floods.\n\nHe was responsible for making sure that the floods occurred on time, and that they were not too destructive.\n\nThe Egyptians believed the pharaoh could influence these events through rituals and offerings to the gods.\n\n![Image 10: A boat floating on the Nile River](javascript:;)\n\nSource: https://pixabay.com/photos/river-nile-egypt-sailboat-dhow-378495/\n\n### The pharaoh's role in foreign diplomacy\n\nThe pharaoh was responsible for maintaining diplomatic relations with other countries.\n\nHe did this by sending ambassadors to foreign lands, and by hosting dignitaries in Egypt.\n\nHe also made treaties with other rulers and negotiated trade agreements. The pharaoh was a powerful ruler, and his word was law.\n\nIn a practice that had developed over several centuries, the also pharaoh used marriage to members of his family to solidify alliances with other countries.\n\nIt is important to understand the Egyptian pharaohs generally did not marry foreign princesses because it was believed that doing so would elevate foreign royalty to their level.\n\nRather, they sent their own daughters to foreign courts or gave lesser wives to foreign princes and kings.\n\nHowever, on some rare occasions in Egyptian history, pharaohs did break this rule.\n\nFor example, Ramses II married a Hittite princess in around 1245 BC to secure a peace treaty.\n\n  \n\n### What would happen if a pharaoh failed in his role?\n\nThe ancient Egyptians believed that the pharaoh was the ultimate authority and the embodiment of Ma’at, the balance and order of the universe.\n\nIf the pharaoh failed in his roles and expectations, it was believed that this would upset the balance and harmony of the universe, which would lead to chaos and disaster.\n\nThe consequences of such a failure could be severe. It was believed that the gods would become angry and punish the pharaoh and his people.\n\nThis would bring about famine, disease, and other forms of suffering. In periods of Egyptian history where these natural disasters occurred, the pharaoh was blamed for causing it.\n\nIn extreme cases, it was believed that the pharaoh’s failure could lead to the end of the world itself.\n\nMoreover, if the pharaoh was seen as weak or ineffective, this could lead to challenges to his authority from within the kingdom or from foreign invaders.\n\nThis could result in civil unrest, rebellions, and wars, which could further disrupt the balance and harmony of the universe.\n\nTherefore, the ancient Egyptians placed a great deal of importance on the role of the pharaoh.\n\nThey believed that his success or failure had profound consequences for the entire kingdom and the world at large.\n\n![Image 11: Egyptian pyramids in the desert](javascript:;)\n\nSource: https://pixabay.com/photos/sphinx-egypt-hieroglyphics-temple-1175828/\n\nReturn to the lesson\n\n### Further reading\n\n  \n\nWhat do you need help with?\n---------------------------\n\n<table cellspacing=\"0\" cellpadding=\"0\" role=\"presentation\" class=\"gsc-search-box\"><tbody><tr><td class=\"gsc-input\"><div class=\"gsc-input-box\" id=\"gsc-iw-id1\"><table cellspacing=\"0\" cellpadding=\"0\" role=\"presentation\" id=\"gs_id50\" class=\"gstl_50 gsc-input\" style=\"width: 100%; padding: 0px;\"><tbody><tr><td id=\"gs_tti50\" class=\"gsib_a\"><input autocomplete=\"off\" type=\"text\" size=\"10\" class=\"gsc-input\" name=\"search\" title=\"search\" aria-label=\"search\" id=\"gsc-i-id1\" dir=\"ltr\" spellcheck=\"false\" style=\"width: 100%; padding: 0px; border: none; margin: 0px; height: auto; background: url(&quot;https://www.google.com/cse/static/images/1x/en/branding.png&quot;) left center no-repeat rgb(255, 255, 255); outline: none;\"></td><td class=\"gsib_b\"><div class=\"gsst_b\" id=\"gs_st50\" dir=\"ltr\"><a class=\"gsst_a\" href=\"javascript:void(0)\" title=\"Clear search box\" role=\"button\" style=\"display: none;\"><span class=\"gscb_a\" id=\"gs_cb50\" aria-hidden=\"true\">×</span></a></div></td></tr></tbody></table></div></td><td class=\"gsc-search-button\"><button class=\"gsc-search-button gsc-search-button-v2\"><svg width=\"13\" height=\"13\" viewBox=\"0 0 13 13\"><title>search</title><path d=\"m4.8495 7.8226c0.82666 0 1.5262-0.29146 2.0985-0.87438 0.57232-0.58292 0.86378-1.2877 0.87438-2.1144 0.010599-0.82666-0.28086-1.5262-0.87438-2.0985-0.59352-0.57232-1.293-0.86378-2.0985-0.87438-0.8055-0.010599-1.5103 0.28086-2.1144 0.87438-0.60414 0.59352-0.8956 1.293-0.87438 2.0985 0.021197 0.8055 0.31266 1.5103 0.87438 2.1144 0.56172 0.60414 1.2665 0.8956 2.1144 0.87438zm4.4695 0.2115 3.681 3.6819-1.259 1.284-3.6817-3.7 0.0019784-0.69479-0.090043-0.098846c-0.87973 0.76087-1.92 1.1413-3.1207 1.1413-1.3553 0-2.5025-0.46363-3.4417-1.3909s-1.4088-2.0686-1.4088-3.4239c0-1.3553 0.4696-2.4966 1.4088-3.4239 0.9392-0.92727 2.0864-1.3969 3.4417-1.4088 1.3553-0.011889 2.4906 0.45771 3.406 1.4088 0.9154 0.95107 1.379 2.0924 1.3909 3.4239 0 1.2126-0.38043 2.2588-1.1413 3.1385l0.098834 0.090049z\" /></svg></button></td><td class=\"gsc-clear-button\"><div class=\"gsc-clear-button\" title=\"clear results\">&#160;</div></td></tr></tbody></table>\n\nCustom Search\n\n<table cellspacing=\"0\" cellpadding=\"0\" role=\"presentation\" class=\"gsc-above-wrapper-area-container\"><tbody><tr><td class=\"gsc-result-info-container\"><div class=\"gsc-result-info-invisible\"></div></td><td class=\"gsc-orderby-container\"><div class=\"gsc-orderby-invisible\"><div class=\"gsc-orderby-label gsc-inline-block\">Sort by:</div><div class=\"gsc-option-menu-container gsc-inline-block\"><div class=\"gsc-selected-option-container gsc-inline-block\"><div class=\"gsc-selected-option\">Relevance</div><div class=\"gsc-option-selector\"></div></div><div class=\"gsc-option-menu-invisible\"><div class=\"gsc-option-menu-item gsc-option-menu-item-highlighted\"><div class=\"gsc-option\">Relevance</div></div><div class=\"gsc-option-menu-item\"><div class=\"gsc-option\">Date</div></div></div></div></div></td></tr></tbody></table>\n\nDownload ready-to-use digital learning resources\n------------------------------------------------\n\n\n\n![Image 12](https://www.historyskills.com//app/module/webproduct/goto/m/maf17a61d2088c2ee)\n\nYear 7 Classroom Teacher Subscription 2025\n\n**$30.00**\n\n![Image 13](https://www.historyskills.com//app/module/webproduct/goto/m/m05bae3a452a68b43)\n\nYear 9 Classroom Teacher Subscription 2025\n\n**$40.00**\n\n![Image 14](https://www.historyskills.com//app/module/webproduct/goto/m/m671beb686adec1c7)\n\nYear 10 Classroom Teacher Subscription 2025\n\n**$40.00**\n\n![Image 15](https://www.historyskills.com//app/module/webproduct/goto/m/m353b41a3734c9d53)\n\nYear 8 Classroom Teacher Subscription 2025\n\n**$35.00**\n\n![Image 16](https://www.historyskills.com//app/module/webproduct/goto/m/m80e223bfc3fdf2d8)\n\nHistorical Research Journal\n\n**$7.00**\n\nCopyright © History Skills 2014-2025.\n\nContact via email\n\nAbout | Return Policy | Privacy Policy | Cookie Policy;)  \nWith the exception of links to external sites, some historical sources and extracts from specific publications, all content on this website is copyrighted by History Skills. This content may not be copied, republished or redistributed without written permission from the website creator. Please use the Contact page to obtain relevant permission.\n\nLog out | Edit\n\n(0)\n\nSubtotal: $0.00\n\nCheck out\n\nYour shopping cart is empty.\n\n  \n\n<table cellspacing=\"0\" cellpadding=\"0\" role=\"presentation\" class=\"gstl_50 gssb_c\" style=\"width: 167px; display: none; top: 10409px; left: 30px; position: absolute;\"><tbody><tr><td class=\"gssb_f\"></td><td class=\"gssb_e\" style=\"width: 100%;\"></td></tr></tbody></table>\n\n Close\n\nx\n\nStrictly necessary\n------------------\n\nStrictly necessary cookies guarantee functions without which this website would not function as intended. As a result these cookies cannot be deactivated. These cookies are used exclusively by this website and are therefore first party cookies. This means that all information stored in the cookies will be returned to this website.\n\n*   Enable all\n\n*   Jimdo-cart-v1\n    \n    Jimdo-cart-v1 Strictly necessary local storage which stores information on your cart to enable purchases via this online store. Provider: Jimdo GmbH, Stresemannstrasse 375, 22761 Hamburg Germany. Cookie/Local Storage Name: Jimdo-cart-v1. Lifetime: Local storage does not expire. Cookie Policy: https://www.jimdo.com/info/cookies/policy/ Privacy Policy: https://www.jimdo.com/info/privacy/\n    \n*   cookielaw\n    \n    Cookielaw This cookie displays the Cookie Banner and saves the visitor's cookie preferences. Provider: Jimdo GmbH, Stresemannstrasse 375, 22761 Hamburg, Germany. Cookie Name: ckies\\_cookielaw Cookie Lifetime: 1 year Cookie Policy: https://www.jimdo.com/info/cookies/policy/ Privacy Policy: https://www.jimdo.com/info/privacy/\n    \n*   PHPSESSIONID\n    \n    PHPSESSIONID Strictly necessary local storage for the correct functioning of this store. Provider: Jimdo GmbH, Stresemannstrasse 375, 22761 Hamburg Germany Cookie /Local Storage Name: PHPSESSIONID Lifetime: 1 session Cookie Policy: https://www.jimdo.com/info/cookies/policy/ Privacy Policy: https://www.jimdo.com/info/privacy/\n    \n*   stripe\n    \n    Stripe This is strictly necessary in order to enable payments powered by Stripe via this store. Provider: Stripe Inc., 185 Berry Street, Suite 550, San Francisco, CA 94107, USA. Cookie Names and Lifetimes: \\_\\_stripe\\_sid(Lifetime: 30 min), \\_\\_stripe\\_mid (Lifetime: 1 year), Ckies\\_stripe (Lifetime: 1 year). Cookie Policy: https://stripe.com/cookies-policy/legal Privacy Policy: https://stripe.com/privacy\n    \n*   ckies\\_\\*\n    \n    Jimdo Control Cookies Control Cookies for enabling services/cookies selected by the site visitor and saving these cookie preferences. Provider: Jimdo GmbH, Stresemannstrasse 375, 22761 Hamburg, Germany. Cookie Names: ckies\\_\\*, ckies\\_postfinance, ckies\\_stripe, ckies\\_powr, ckies\\_google, ckies\\_cookielaw, ckies\\_ga, ckies\\_jimdo\\_analytics, ckies\\_fb\\_analytics, ckies\\_fr Cookie Lifetime: 1 year Cookie Policy: https://www.jimdo.com/info/cookies/policy/ Privacy Policy: https://www.jimdo.com/info/privacy/\n    \n\nx\n\nFunctional\n----------\n\nFunctional cookies enable this website to provide you with certain functions and to store information already provided (such as registered name or language selection) in order to offer you improved and more personalized functions.\n\n*   Enable all\n\n*   powr\n    \n    POWr.io Cookies These cookies register anonymous, statistical data on the behavior of the visitor to this website and are responsible for ensuring the functionality of certain widgets utilized by this website. They are only used for internal analysis by the website operator, e.g. for the visitor counter, etc. Provider: Powr.io, POWr HQ, 340 Pine Street, San Francisco, California 94104, USA. Cookie Names and Lifetime: ahoy\\_unique\\_\\[unique id\\] (Lifetime: session), POWR\\_PRODUCTION (Lifetime: session), ahoy\\_visitor (Lifetime: 2 years), ahoy\\_visit (Lifetime: 1 day), src 30 Days Security, \\_gid Persistent (Lifetime: 1 day), NID (Domain: google.com, Lifetime: 180 days), 1P\\_JAR (Domain: google.com, Lifetime: 30 days), DV (Domain: google.com, Lifetime: 2 hours), SIDCC (Domain: google.com, Lifetime: 1 year), SID (Domain: google.com, Lifetime: 2 years), HSID (Domain: google.com, Lifetime: 2 years), SEARCH\\_SAMESITE (Domain: google.com, Lifetime: 6 months), \\_\\_cfduid (Domain: powrcdn.com, Lifetime: 30 days). Cookie Policy: https://www.powr.io/privacy Privacy Policy: https://www.powr.io/privacy\n    \n*   Google Maps\n    \n    Activating and saving this setting will enable the display of Google Maps on this website. Provider: Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA or Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Ireland, if you are a resident of the EU. Cookie name and Lifetime: google\\_maps ( Lifetime: 1 year). Cookie policy: https://policies.google.com/technologies/cookies Privacy policy: https://policies.google.com/privacy\n    \n*   Youtube\n    \n    Activating and saving this setting will enable the display of Youtube video content on this website. Provider: Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA or Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Ireland, if you are a resident of the EU. Cookie name and Lifetime: youtube\\_consent (Lifetime: 1 year). Cookie policy: https://policies.google.com/technologies/cookies Privacy policy: https://policies.google.com/privacy This website uses a cookie-less integration for the embedded Youtube videos. Additional cookies are set by the service provider YouTube and information is collected if the user is logged in to their Google account. YouTube registers anonymous statistical data, e.g. how often the video is shown and which settings are used for playback. In this case, the user's selections are associated with their account, such as when they click \"Like\" on a video. Please see the Google privacy policy for more information.\n    \n\nx\n\nPerformance\n-----------\n\nPerformance cookies gather information on how a web page is used. We use them to better understand how our web pages are used in order to improve their appeal, content and functionality.\n\n*   Enable all\n\n*   ga\n    \n    Google Analytics These cookies collect anonymous information for analysis purposes, as to how visitors use and interact with this website. Provider: Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA or, if you are resident in the EU, Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Ireland. Cookie names and Lifetimes: \\_\\_utma (Lifetime: 2 years), \\_\\_utmb (Lifetime: 30 minutes), \\_\\_utmc (Lifetime: session), \\_\\_utmz (Lifetime: 6 months), \\_\\_utmt\\_b (Lifetime: 1 day), \\_\\_utm\\[unique ID\\] (Lifetime: 2 years), \\_\\_ga (Lifetime: 2 years), \\_\\_gat (Lifetime: 1 min), \\_\\_gid (Lifetime: 24 hours), \\_\\_ga\\_disable\\_\\* (Lifetime: 100 years). Cookie Policy: https://policies.google.com/technologies/cookies Privacy Policy: https://policies.google.com/privacy\n    \n\nx\n\nMarketing / Third Party\n-----------------------\n\nMarketing / Third Party Cookies originate from external advertising companies (among others) and are used to gather information about the websites visited by you, in order to e.g. create targeted advertising for you.\n\n*   Enable all\n\n*   powr\\_marketing\n    \n    POWr.io Cookies These cookies collect anonymous information for analysis purposes about how visitors use and interact with this website. Provider: Powr.io, POWr HQ, 340 Pine Street, San Francisco, California 94104, USA. Cookie Names and Lifetime: \\_\\_Secure-3PAPISID (domain: google.com, lifetime: 2 years), SAPISID (domain: google.com, lifetime: 2 years), APISID (domain: google.com, lifetime: 2 years), SSID (domain: google.com, lifetime: 2 years), \\_\\_Secure-3PSID (domain: google.com, lifetime: 2 years), CC (domain: google.com, lifetime: 1 year), ANID (domain: google.com, lifetime: 10 years), OTZ (domain: google.com, lifetime: 1 month). Cookie Policy: https://www.powr.io/privacy Privacy Policy: https://www.powr.io/privacy\n    \n*   fb\\_analytics\n    \n    Facebook Analytics This is a tracking technology which utilizes the so-called, \"Facebook pixel\" from the social network Facebook and is used for website analysis, ad targeting, ad measurement and Facebook Custom audiences. Provider: Facebook Inc, 1 Hacker Way, Menlo Park, CA 94025, USA, or, if you are resident in the EU, Facebook Ireland Ltd, 4 Grand Canal Square, Grand Canal Harbour, Dublin 2, Ireland. Cookie name(s): \\_fbp, fr Cookie Lifetime: 90 days Cookie Policy: https://www.facebook.com/policies/cookies Privacy Policy: https://www.facebook.com/policy.php\n    \n\nx\n\nCookie Policy\n-------------\n\nThis website uses cookies to give you the best online experience. Please let us know if you agree by clicking on the “Accept” option below. If you’d like to find out more about the cookies we use and set your individual cookie preferences, please review our Cookie Policy.\n\nImprint Privacy Policy\n\n*   Strictly necessary\n    \n*   Functional\n    \n*   Performance\n    \n*   Marketing / Third Party\n    \n\nAccept all Accept only selected Reject all Save and go back\n"
}