{
  "https://www.thecollector.com/shinobi-ninjas-japan/": "Title: Shinobi: Japan’s Legendary Assassins (Fact vs. Fiction)\n\nURL Source: https://www.thecollector.com/shinobi-ninjas-japan/\n\nPublished Time: May 15, 2023\n\nMarkdown Content:\n\n\nIn the dead of night, a black-clad man crawls along the roof of a Japanese castle. In the courtyard below, two samurai walk their patrol routes. The figure inches to the edge of the roof, and deadly _shuriken_ soon bury themselves in the guards’ necks. They die almost instantly without making a sound. Our figure drops to the ground, hiding his victims in a nearby bush before sliding the nearby _shoji_ door open, drawing a dagger as he approaches his sleeping victim…\n\n…and then comes the director’s voice: _“Cut!”_ As gripping as that little scene might have been, the reality of Japan’s _shinobi_ was quite different from the pop culture version.\n\n**History of the Shinobi**\n--------------------------\n\n\n\nKabuki Ninja, by Utagawa Kunisada, 1830s, via Ukiyo-e.org\n\nLike many concepts in Japanese, there are two different names for the shinobi; you might also know them as “ninjas”. Basically, they’re the same thing, just two different words. Ninja is the Chinese word, whereas shinobi-no-mono (lit. “one who endures/hides”), or shinobi for short, is the native Japanese word. In any case, the earliest that the shinobi seem to have existed in the form that we recognize is from the 15th century, during the onset of the Sengoku Period. Of course, the idea of subterfuge is far older than that. After all, as Sun Tzu put it, _“All warfare is based on deception.”_\n\nThe earliest known allusions to what could possibly have been shinobi occur in the _Taiheiki_, or _Chronicle of Great Peace_, written in the 14th century. This document mentions the various war strategies that occurred during the Nanbokucho War between the Northern and Southern Imperial Courts in the 1330s. Shinobi were employed by both sides.\n\nA common origin belief is that shinobi arose from oppressed peasants who needed a way to strike back against their better-armed samurai overlords. However, although shinobi could be recruited from the peasantry and trained from childhood, they were often samurai who undertook special training and were willing to do things others might deem dishonorable. Hattori Hanzo, arguably one of the most well-known shinobi, was actually a samurai himself and known to work alongside Tokugawa Ieyasu. Most _shinobi_ came from the Iga and Koga regions of Japan just outside Kyoto.\n\n**The Shinobi Role in War and Peace**\n-------------------------------------\n\n\n\nPrince Genji with Ninja, by Utagawa Kunisada, 1853, via Ukiyo-e.org\n\nThe most recognizable (according to Hollywood) role of the shinobi was committing assassinations. However, more often, they acted as spies, arsonists, and saboteurs, and they committed many other acts of subterfuge against their enemies. They could provide information on troop movements, the state of a fortress, or various goings-on in a castle or encampment. All this occurred during the Sengoku Period. The famous Uesugi Kenshin was supposedly killed by a shinobi hidden in his latrine. At least that’s the legend; more likely it was esophageal or stomach cancer.\n\nThey did not participate in open fighting; the role of a shinobi was to be secretive, and getting in a fight ran contrary to that purpose. So all the legends about ninjas having superhuman levels of fighting prowess are almost entirely fabricated. After the fighting died down in Japan, the shinobi switched to a peacekeeping role. They would be hired as secret observers to quell any mounting unrest by dealing with agitators and reporting possible plots to the daimyo.\n\n**Tools and Weapons**\n---------------------\n\n\n\nWooden Kunai and Shuriken Replicas, via Pxhere\n\nWhen asked to name ninja weapons, the straight-bladed _ninjato_, _kunai_, and _shuriken_ are the first that come to mind. The shinobi, if they carried a sword at all on a mission, would more likely use a _wakizashi_ because it was something anyone could conceivably own. Kunai, those daggers you sometimes see used as melee weapons in anime, were actually used more as climbing aids or as distractions. _Shuriken_, the ubiquitous throwing stars, were also used as distractions or as an emergency close combat weapon. Other bladed implements included caltrops and climbing claws to name just a couple.\n\nAnother reason shinobi did not usually carry weapons is that most weapons are bulky and hard to conceal. Imagine trying to scale a castle wall with, say, a bow and quiver of arrows on your back and you’ll see it would definitely not be feasible. If one was disguised as an enemy soldier to infiltrate a camp, they would carry weapons as appropriate to maintain a convincing disguise.\n\nOutside of weaponry, more utilitarian tools helped shinobi traverse environments, provide distractions, or gain access to places otherwise unreachable. So-called “fire tools” such as firecrackers, specialized lanterns and fire-starting devices provided light sources. “Water tools” included snowshoe-like objects, woven rafts, and other items to help traverse or hide under water. For getting over walls, they would have used grappling claws and various kinds of portable ladders. However, shinobi were also expected to be able to use the environment to their advantage and find whatever was available.\n\n**Clothing**\n------------\n\n\n\nNinja Gauntlet and Leg Armor, via Wikimedia Commons\n\nThe stereotypical black catsuit isn’t something a shinobi would wear. Black is not a good color for stealth or camouflage because black creates a silhouette even at night. It also does not occur often in nature. Their colors would have been navy blue or dark gray because those blend in better. The look of the outfit itself would also have drawn suspicion, so they only wore it when doing nighttime missions when they weren’t expected to interact with anyone.\n\nThe black outfit you know actually came from _kabuki_. Stagehands in these performances wore all black and openly moved on the stage. The audience was expected to pretend they weren’t in the scene, but if a play called for the sudden, unexplained death of a character, the killer would be dressed in this garb so it looked like the victim dropped dead from an invisible attacker.\n\nWhen performing missions in daylight, shinobi hid in plain sight. A good shinobi would study the clothing, hairstyles, accent, and dialect of people in the area the shinobi intended to infiltrate so as to accurately mimic a resident. They would keep forged travel passes and other documents to support their false identity and also learn the skills of whatever the disguise warranted. If they expected to encounter unavoidable resistance, they would wear light, easily-concealed armor such as the items shown in the image above.\n\n**Covert Skills**\n-----------------\n\n\n\nPriest Leaning Against Tree, by Utagawa Kuniyoshi, 1845, via Ukiyo-e\n\nThe covert skills of the shinobi can be grouped into two categories: _in-nin_ and _yo-nin. In_ and _yo_ are the Japanese words for the yin and yang of Chinese Taoist belief. _In_ represents moonlight, darkness, femininity, and passivity, among other things. _Yo_ represents the opposite: sunlight, light, masculinity, and agency. Neither is considered inherently good or evil, just part of a larger whole.\n\n_In-nin_ skills represent the stereotypical nighttime cloak-and-dagger work that shinobi did. Hiding out of sight of enemies, sneaking into fortifications, committing arson, assassination, and the like were part of _in-nin_ skills. Knowing the best points at which to sneak into a castle, knowing how to determine whether someone was truly asleep or only pretending to be, and knowing when was the best time to gain entrance to a castle were also part of this set of skills. But, as mentioned, this is only half the picture, and if the _Bansenshukai_ manual compilation is to be believed, it was the less-desirable part.\n\n_Yo-nin_, meanwhile, was more about acting openly in such a way that no one would suspect the true intentions of a shinobi. This is where things like disguises (such as dressing like a priest as in the image above), spying, bribes, persuasion, and the like come into play. Many of these strategies are adopted from Sun Tzu’s suggestions. For example, a shinobi might survey an area and learn about peoples’ relationships with their daimyo or whoever the relevant party was. Part of _yo-nin_ skills involved knowing when and where to seek an inside agent, as well as the means by which to secure their allegiance.\n\n**What About the Shinobi’s “Supernatural” Powers?**\n---------------------------------------------------\n\n\n\nWu Xing Diagram, by Parnassus, 2013, via Wikimedia Commons\n\nThe shinobi were said to have outright supernatural powers such as turning invisible, teleportation, manipulation of the elements, walking on water, and shapeshifting. Of course, these things fall squarely within the realm of fantasy, but the clever use of ninja tools and guerilla tactics helped to create the illusion of supernatural abilities. Shinobi, being masters of misdirection, had it in their best interest to allow such stories to propagate.\n\nMention is made in some of the older chronicles about the use of _mudras_, or hand seals, along with mantras, or chants to create magical effects. These were mostly intended for a psychological boost, i.e. to trigger a certain mental state accessed through meditation but they were referred to as outright magic in the manuals as a form of misdirection. Believing that a shinobi actually possessed supernatural powers was a way to increase the mystique behind these figures. It also goes back to the idea of disguise: one disguise a shinobi could undertake was that of a _yamabushi_. These wilderness-dwelling monks were said to practice an esoteric branch of Buddhism known as Shingon, which made use of hand signs and the like as meditative aids.\n\nOther lore in the shinobi manuals references Wu Xing, the classical Chinese elemental system: wood, fire, earth, metal, and water. Each element had certain character traits associated with it, a different direction, time of day, parts of the body, etc. The different elements also interacted with one another via a nourishing and overcoming cycle, as demonstrated in the diagram above. Shinobi were encouraged, even if they did not fully believe in such things, to learn these associations to better gauge how a given target who did adhere to them might act and exploit certain weaknesses.\n"
}