{
  "https://www.wayofninja.com/dante-day-in-life-ninja-training/": "Title: A Day in the Life: Ninja Training Regimen\n\nURL Source: https://www.wayofninja.com/dante-day-in-life-ninja-training/\n\nPublished Time: 2012-09-15T00:02:34+00:00\n\nMarkdown Content:\nMy name is Dante, and I currently use a simple, yet effective, training regime to keep in shape and to hone my ninja way. I train on days I don’t have to work; I work part time so sometimes I train half-days. My training schedule focuses a lot on sword skills and honing those skills.\n\nIf you don’t train with swords, you can use this training regime as a template and substitute your own martial arts techniques.\n\nMy usual training days go like this:\n\n### Wake up\n\n*   Meditate 20-30 mins (1 hour if possible)\n*   Get cleaned up for the day\n*   Eat, eat, eat\n\n### Warm up\n\n*   Stretching\n*   Kata (with bokken) only basic skills\n*   Crunches (20, 30, 20)\n*   Curls in between crunches, 20lb dumbells (sets of 20)\n*   Meditate 5-10 minutes, plan training\n\nThis period of meditation is crucial for me to get focused and get into the mind-set of perservering through the entire training schedule.\n\nI do my curls early in the day because after training all day with a sword, the arms tire and it’s more difficult to do in the evening. Also, I only practice basics in the morning with the bokken because I know I’m not fully awake, and I only want to do the stuff I could do in my sleep, no pun intended. This reduces the chance that I might injure myself or someone else. For those of you who don’t know what Kata are, they are the stances and moves you practice in martial arts. The advantage of using kata is that you do not require a second person (and I usually train alone).\n\n\n\nWhen practicing kata for Kenjutsu or Kendo, you can start with Chudan-no-Kamae or Chudan for short. This is the “middle” stance, and the basic, most widely used stance in most schools of sword arts. Basically, you stand either in a linear Kendo stance, or a broadened Kenjutsu stance. Hold the Bokken or Shinai or Sword with both hands, one at the ”tsuba”, or sword guard, and one at the base of the hilt near the pommel. Hold the sword so that the tip of the blade is pointed at your imaginary enemy’s throat. That’s your basic middle stance.\n\nNow you’re ready to begin. After getting focused, the training begins:\n\n### Morning Ninja Training:\n\nKata (first with bokken, then with unsharpened katana)\n\n*   10-15 minutes,\n*   break,\n*   10-15 minutes,\n*   break,\n*   repeat until all skills reviewed\n\nRun (optional)\n\n*   Run around my neighborhood (including parkour)\n*   Walk to the old factory, free-run\n*   Walk home.\n\n### Lunch break (1 hour 30 mins)\n\n*   eat\n*   play Xbox\n*   get on Facebook\n*   shower if needed\n\nLunch is very important, and the lunch break is just as crucial. Remember to eat food that is somewhat healthy; you will need it for an active lifestyle. If you’re a hard-gainer like me, now’s the time to consume some more white carbs, protein, and calories. It is also a time to get stuff out of the way that is distracting from training, like that text from your girlfriend, that message on Facebook, or that phone call you ignored while meditating.\n\nMy lunch is usually around 12-1 p.m. depending on how long it takes to finish my morning training schedule. Once I eat, clean up, chill for while, then it’s back to training.\n\n### After Lunch Ninja Training\n\n**Meditate 5-10 minutes, get focused**\n\nThis meditation point is extremely important, and sometimes takes longer. I really need to be focused because I train with live weapons.\n\n**Kata (sharpened katana)**\n\nPracticing only advanced techniques that I am comfortable with.\n\n**Kata with 2 short swords (1 sharp, 1  dull)**\n\nPracticing only basic techniques, only techniques I know.\n\n**Bare-hand techniques**\n\nSame as pre-lunch kata. Train, break, train, break, train repeat.\n\nIt’s important to remember that training is what you make it, and you get out of it what you put into it. If you want to be good in the skills you possess, you must practice them. Practice may not make you perfect, but it WILL make you better!\n\n### Cool Down\n\n*   Meditate, 20-30minutes\n*   Stretch\n*   Drink water, at least 32 oz.\n*   Rest, misc.\n*   Continue with daily activities\n\nIt may seem like a lot, but it’s really not. It doesn’t take long if you stay focused. The main thing is to make sure you stay hydrated throughout. Dehydration leads to injuries (and I can’t afford to be careless when training with real weapons).\n\nAlso, if you don’t feel comfortable training with live weapons i.e. sharpened swords, etc. DON’T. I can’t tell you how many times I’ve messed up a good training day with an injury because I didn’t feel comfortable at a certain point in training. Remember, no one is forcing you to train. So, go at your own pace, and work your way up to where you want to be.\n\nIf your schedule is too busy for a regime like this one, try just taking 30 minutes a day (about the length of a TV show) to exercise or practice your martial arts/parkour. It’s a good way to start, and eventually you may find that you have more free time in a day than you have realized.\n\nIt is all about the will; the will to train, the will to practice, the will to DO. I remember when I first started meditating. I couldn’t force myself to be still long enough to just not do anything. So i started meditating when I woke up in the morning. I would meditate before even getting out of bed so that I had no real distraction from doing it. I still meditate in the morning, because of that same reason.\n\nYou have to push your own limits because, if your training environment is like mine, no one’s gonna do it for you, and no else is there to push you through. You’ve got to summon whatever perserverance and willpower you have inside you to work through till the end. And when you get to the end, when you finish training and practicing for the day, you will look back at that willpower and it will inspire you to keep going. Always remember to keep moving, keep trying and keep pushing so you have no regrets when all is said and done.\n\nGood Luck with your training, and follow your way of ninja\n\nDante\n"
}