{
  "https://www.thebioneer.com/real-ninja-training/": "Title: Real Ninja Training\n\nURL Source: https://www.thebioneer.com/real-ninja-training/\n\nPublished Time: 2019-01-14T18:28:38+00:00\n\nMarkdown Content:\nModern popular culture has a fascination with ninjas. They are prominently featured in video games, comic books, movies, and novels. Many characters that we consider synonymous with modern times – like Batman in particular – are heavily inspired by stories of ninjas.\n\nAnd yet all this may be based on a fantasy. The ninja were likely not what you imagine them to be. They did not wear all black. ‘Ninjutsu’ (Shinobi No Jutsu) is not a fighting style. And they were not the sworn enemy of the samurai. As hard as I looked, I could find no secret ninja training method for jumping higher. In fact, they probably weren’t even _called_ ninja until relatively recently – with shinobi being the more accurate pronunciation of the kanji.\n\nBut before you get too disheartened and dismiss the whole notion of ninjas being awesome, keep in mind that real ninja training was in some ways even cooler.\n\nWho Were the Ninjas Really?\n---------------------------\n\nNinjas actually had a lot more in common with modern MI6 or CIA agents. What makes them cooler though, is that unlike those agents, they would also be required to engage with the enemy – essentially combining the role of the intelligence officer with that of spec ops. They would infiltrate enemy castles, collect information, and potentially leave a trail of chaos and destruction in their wake. All without being noticed.\n\nA shinobi was actually a classification of samurai warrior, who would be tasked with espionage, guerrilla warfare, arson, and assassination missions and would utilize stealth, disguise, and a range of tools in order to complete those jobs. So, the shinobi were not the ‘enemies of the samurai’ any more than spec ops are the enemy of army infantry – they were simply different roles within feudal Japan’s military force between the 15th and 17th centuries. Many of the principles and ideas driving the use of ninjas were imported from the military strategies of China’s Sun Tsu, author of the _Art of War_. This seminal text on asymmetric warfare emphasizes the importance of terrain, timing, and strategy in conflict and is still incredibly relevant today.\n\n\n\nReal ninja training was all about subterfuge, planning, and timing then. By taking strategic advantage of the land, the element of surprise, and most importantly – deception – a small army can take on a much larger one.\n\nLikewise, by using a few stealthy and strategic ninjas, it would be possible to thwart the efforts of a much larger army through surprise attacks, and guerrilla warfare. They were employed to this end by the feudal lords (daimyos) of their era.\n\nIf you needed someone to scope out an enemy encampment for entry points, you would send a ninja. If you needed someone to break into a castle in the dead of night to kidnap a military general’s daughter, you would send a ninja.\n\n\n\nReal ninja training isn’t a fighting style then, because this training was supplementary to basic samurai training. Shinobi No Jutsu was a series of strategies, concepts, and instructions to aid with espionage and deception. The fighting style they used then would likely have been kenjutsu, similar to modern kendo. It is also a myth that ninjas would have used straight swords – instead they likely used the same curved katanas as any other samurai.\n\nReal Ninja Training – What We Know\n----------------------------------\n\nSo what extra training _did_ ninjas engage in? What can we learn from real shinobi training? The general concept behind ninjutsu is deception. It has been said that _all_ combat is really deception, and ninjutsu simply takes this to its natural extreme.\n\n> All combat is really deception\n\nWhat we know of this real ninja training comes from three ancient ninja scrolls: the Shoninki, the Ninpiden, and the Bansenshukai. These have since been translated into English and can be bought and read by anyone. These texts deal almost exclusively with the use of tools, herbal concoctions, psychological warfare, explosives, disguise, and stealth. Again, there is nothing of a physical regimen described, nor are there any combat techniques.\n\n\n\nLike regular samurai, ninjas would have been born into their professions with the traditions and fighting styles being passed down from generation to generation, predominantly in the Iga and Koga regions. Many more scrolls likely existed which may have been lost, or still be in the possession of those families.\n\nOther than these scrolls, information on ‘real ninja training’ comes from individuals who claim a direct family or teaching lineage tracing back to the ninjas of old. There are recently four individuals to make such claims: the late Seiko Fujita who claimed to be the 14th master of the Koga school, Toshitsuga Takamatsu, Maasaki Hatsumi, and Jinichi Kawakami. None of their statements have been proven, however this is not to say they cannot be true. All we can do is to try and assess their credibility based on the assessments of other scholars and institutions, and the congruence (or lack thereof) with other texts.\n\nVerification of sources on ninjutsu then is extremely difficult and has led to many heated debates. However, several themes and concepts do occur repeatedly across all sources, making it likely that they at least are accurate.\n\nEspionage and Stealth\n---------------------\n\nThe image of the black-clad ninja crawling across rooftops is only partially true. It is true for instance that real ninjas would have scaled buildings in this manner, and in fact they would even have carried folding bamboo or rope ladders at times for crossing between rooftops. They also carried tools they could use to bore through walls (which they first lubricated with herbs in order to silence). They may also have used samurai swords as a ‘step up’ when scaling walls, by propping them up against them and then stepping on the tsuba – or hand guard. Should someone catch a glimpse of a ninja spy, they would scatter items on the other side of the building as a distraction.\n\n\n\nWays to mask sounds actually take up a fair chunk of the ninja scrolls. Other advice includes learning to mimic the sounds of local wildlife. That way, should a guard hear a rustling sound, the ninja can make it seem as though the noise came from a harmless animal. Likewise, this allowed ninja to ensure the authentic sounds of wildlife would not stop when they arrived – it’s just as important that you don’t interrupt the current soundscape as it is that you don’t create additional noise.\n\nOnce inside, ninjas were taught to move close to the walls where floorboards were least likely to creak. Hugging walls would also allow them to reduce their visible silhouette. To minimize noise, they would breathe through their mouths, and reportedly sometimes insert a small piece of paper to further dampen the sound of their breath and prevent it being felt on the face of a sleeping target.\n\nReal ninja training also included lessons on how to move silently. A number of specific movement patterns were taught to enable this, including a controversial one that involved stepping on their own hands.\n\n\n\nAnother interesting recommendation is the use of a ‘soft noise test’. This would involve testing to see if an area was clear or if guards were on high alert, by making a very subtle sound. If no one reacts, then you will be safer to proceed.\n\nOtherwise, you wait. A huge part of stealth is simply _patience_.\n\nThere are countless more stealth tips to be found in ninja scrolls, from moving into the wind, to creating distractions in order to get past guarded gates.\n\nShinobi Clothing\n----------------\n\nWhere reality probably differed from myth however is in the garb. There is no evidence that ninjas wore masks though it is not outside the realms of possibility. Likewise though, there is no historical record of ninjas wearing all black. It has been suggested that ninjas may have been more likely to wear dark blue so as to more closely blend into the night sky. However, they would far more often have worn civilian clothes in order to move among crowds unnoticed. A particularly popular ploy was to dress as a homeless person, so as to move unnoticed and to minimize interactions. They would even practice limping and moving so as to appear feeble – lowering others’ estimations of their abilities.\n\nAccording to _Ninja Skills –_ a great book on real shinobi training – there is evidence that during the Sengoku period, Shinobi may have worn a particular crest and jacket during training and operations – advertising their status to other samurai.\n\nIn other instances, they may have worn large hats to disguise their identity, or dressed as farmers. The latter allowed them to carry tools that could be used for self-defence without arousing suspicion.\n\nThe Bansenshukai – real ninja training manual – includes numerous tips and strategies for those interested in mastering the art of disguise, explaining how small details like a pebble in the shoe to alter gait can go a long way to obscuring an identity. These same techniques are used in the CIA to help agents disappear in the field – even switching identities on the move without drawing attention to themselves.\n\nNinja Tools\n-----------\n\nShinobi carried a wide range of different tools at different times in order to get the upper hand on their opponents. We’ve already discussed the use of bamboo ladders for instance.\n\nOne of my favorite examples is their use of pointed tacks called caltrops (called makibishi) that they would scatter behind them whilst fleeing. Pursuers might then step on these and injure their feet.\n\nWhen infiltrating an enemy base or castle, ninjas would scatter these tacks around all the exit points keeping note of their exact locations. This way, when discovered, they could escape and take out large numbers of the opposition. Similarly, they have been known to pull down wooden bridges, and set fire to access points. This is the perfect example of how a single stealthy ninja can take on far greater numbers through sheer cunning.\n\nAs seen in much fiction, grappling hooks were also used commonly by ninjas. These were not only for scaling walls, but also for other uses such as pulling down the wooden supports of bridges – often while pursuers were standing on them.\n\n> A common theme of so many of these tools is that they gave ninjas the ability to move where others could not, quickly and silently.\n\nAnd of course we know that they used shuriken, though these were more about distracting opponents than offence.\n\nThere are many more examples of tools used by ninjas. One of the simplest ‘tools’ that many shinobi would carry was a rope. This had countless uses, included lifting other heavier tools after scaling a wall. Likewise, they used a short tool called a Kunai for digging their way under fences. They had thick sacks that they used to push themselves through thick hedges and brambles. They wore ‘silent sandals’ with padded soles to help with stealth.\n\nA common theme of so many of these tools is that they gave ninjas the ability to move where others could not, quickly and silently.\n\nNinja were adept at crafting explosives, poisons, adhesives, and more from the surrounding fauna. Arson was actually a large part of the ninja craft, and smoke bombs and similar were often used for distraction and offensive strategies. They even had ingredients for energy snacks that could sustain them for hours on end.\n\nPsychological Warfare\n---------------------\n\nA large part of ninjutsu training was learning how to understand and manipulate people. Many of the ‘soft skills’ discussed in my video on MI6 training would apply here: their job would often involve reconnaissance and extracting information, meaning that they needed to know how to get people to talk and how to identify potential informants.\n\nOne piece of advice (possibly from the ninja legend Hatori Hanzo) was to approach ‘formerly important’ individuals who had ‘since fallen out of favor’. Such people are more likely to be candid with gossip, while also being in a position to share lots of sensitive information.\n\nLikewise, a ninja must learn to gain the trust of people from all classes and ways of life – to adapt their demeanour and behaviour to fit in.\n\n\n\n‘Playing dumb’ is also a strategy that is often recommended for ninjas. Feigning ignorance increases the likelihood that others will tell you things in confidence as you appear to pose no threat. Likewise, it suggests you have more to learn.\n\nThis requires the ninja to completely abandon their ego in service of their mission. And it mirrors a lesson from Sun Tsu:\n\n> **_“Appear weak when you_** _are **strong**, and **strong when you are weak**. If your enemy is secure at all points, be prepared for him. If he is in superior strength, evade him. If your opponent is temperamental, seek to irritate him.”_\n\nIn short, posturing gets you nowhere – unless it is strategic posturing.\n\nOvercoming social pressures is an incredibly useful objective and one I’ve talked about in the past with regards to CBT and soft skills.\n\nPhysical Ninja Training\n-----------------------\n\nUnfortunately, we know very little of the physical training regimen of the ninja or their hand-to-hand combat.\n\nAs mentioned, real ninja training would have been largely the same as samurai training with additional skills being taught on top.  While emphasis would have primarily been on armed combat, samurai would also have learned a number of ‘empty hand’ techniques and likely jujitsu, from which aikido, judo, and some forms of karate such as wado-ryu are derived. So if you use any of these styles then congrats: you already do a form of real ninja training! Sort of.\n\nWe can also make some assumptions about the types of physical ninja training that would have been logical. Ninjas required a certain degree of athleticism for rope climbing, and they were also known to climb high into trees in order to hide and/or as a lookout. Climbing and bodyweight training then, would seemingly be sensible options.\n\nSome of the aforementioned ‘last ninjas’ do however claim to have insider knowledge regarding the types of physical training ninjas might have engaged in. Seiko Fujita for instance, describes ninjas as doing a lot of hiking – being able to walk 350 miles between Edo (Tokyo) and Osaka in just three days. He describes a specific walking technique that involved leaning forward in order to move more quickly – similar to the concept of chi running.\n\n\n\nFujita also describes wooden sandals designed specifically to train leg strength and balance. Fujita says that ninjas did _indeed_ train specifically for jumping, and that they were able to jump up to 7 feet in the air – high enough to leap straight over an opponent. Assuming this is a vertical jump, this would be two foot higher than what is believed to be the world record (held by Kadour Ziani, though not officially verified). It is more than likely that such claims are hyperbolic, but it is also true that some form of foot/jump training would have been involved.\n\nThen there’s the old folk story about the ninjas using bamboo, jumping over a small bamboo shoot every day and getting higher as it grew. There’s no evidence for this – but it is a simple example of progressive overload.\n\nMore uncredited sources describe ninjas as jumping out of and over holes they dug for practice, and also using ‘calf jumps’ – jumping using only their feet while keeping their legs entirely straight.\n\n\n\nKawakami similarly describes walking on the sides of the feet to strengthen them. He also talks about hardening the body through conditioning.\n\nSo, while we can’t know for sure, it’s possible that real ninja training might have supplemented martial arts training and shinobi no-jutsu with bodyweight training, plyometrics, jump training, body hardening, climbing, and long-distance cardio.\n\n\n\nMental Training\n---------------\n\nSurprisingly, included in the scrolls is guidance for daily work – suggesting the ninja may have been more than mercenaries. These segments also teach the martial qualities of mundane tasks – Mr Miyagi style. In short: everything can be training. This is a great take-home lesson – if you apply focus and increase the challenge, you can turn household chores and more into training.\n\n\n\nNinjas also learned some interesting mental strategies to help them on their missions. These included the use of beans transferred between two pouches for counting. That is to say, that rather than have to remember how many enemies they counted, they simply moved a bean from one bag to the next each time they spotted another combatant. This way, they could keep track accurately in a time before smartphones – and it was much quicker and quieter than using pen and paper.\n\nLikewise, ninjas learned to use covert signals to communicate with one another, that would sound like harmless background noise when overheard. They also had methods for calculating the height of walls (using a sticky arrow and a piece of rope pulled taut) so that they could craft ladders of the correct size.\n\nLike many explorers, Shinobi knew how to navigate by looking at the stars, and how to asses the weather and moon in order to time an infiltration when they will be most concealed.\n\n> Shinobi knew how to navigate by looking at the stars\n\nNinjas used special spells and incantations that they believed could help them on their missions. These would grant them invisibility, stealth, and good fortune and could be used prior to or during missions. Largely, they fall under the heading of ‘Onmyodo’.\n\nOf course today, we probably assume that these incantations would _not_ be effective. That said, it is possible that they had psychological or placebo effects – potentially serving as anchors and mantras that helped to keep the user calm and to help them embody the nature of animals, or particular properties, more fully.\n\nMore useful today, is the practice of developing attention and sharp reflexes. Jinichi Kawakami describes a training method that involved listening for the drop of a pin prick. He and several other sources describe meditation while watching candle flame, which is actually a common meditation technique used today.\n\n\n\nThere are some who believe that ninjas were descendants of Yamabushi – mountain priests – who eventually settled in the Koga and Iga regions and began taking on work as assassins and spies. The Yamabushi sought superhuman powers through closeness with nature, asceticism (abstinence), martial arts, and feats of endurance. Yamabushi are often pictured sitting underneath waterfalls, which would help to both hone the senses, endure the elements, and toughen the body. Whether this was a practice that ninjas in fact continued is uncertain, likewise it is possible but not certain that ninjas would have used mental training in common with Yamabushi to stay calm and focussed under pressure.\n\nWhat Can We Learn From Shinobi Training Today\n---------------------------------------------\n\nThis script is currently nearly 3,000 words long and I only touched lightly on what we know about ninjas. It’s a topic that I will definitely be exploring further in future. In the next couple of weeks, I’ll be uploading a post to the Bioneer looking at how to take all these lessons and directly apply them to modern life – to become an ‘21st century’ ninja if you like. You know, for funsies. Kawakami says that the skills of the ninja are no longer useful today. Whether that’s entirely true is up for debate, but we can certainly take the _principles_ of shinobi no-jutsu and apply them to modern training and contexts. What could a ninja do today with a drone, ethical hacking skills, parkour, and potent knowledge of biochemistry? That’s what we’ll be looking at.\n\nSo what can we take from all this right now? First of all: the value of deception, surprise, stealth, and asymmetrical warfare. By being strategic and smart, you can defeat an opponent who is physically stronger, or who has the advantage in numbers. This is true in politics, in business, and in self-defence. One of my favorite lessons from my old karate teacher was that you could often overcome an attacker by striking them mid-sentence – it is human nature to try and wait for someone to finish speaking.\n\nWe also see the importance – again – of soft skills. This is more important now than ever, and being able to persuade people, negotiate, get people on side, and bide time, will get you further in business, relationships, and more than will learning to jump high. Combined with the ability to focus intently, stay calm, and move with accuracy and precision – you could continue in the spirit of real ninja training, and thrive as a result.\n\n> “_Competent ninja, even if they have accomplished the extraordinary, make no sound, leave no smell, and get no fame or honour for their bravery.”_\n"
}