{
  "https://gravity.fitness/blogs/training/how-to-train-as-a-modern-day-ninja?srsltid=AfmBOooRwBZUOU_IVeNbMVYQn36qvYzpO6y_AF3J4_xJvAa8qwCVkuM7": "Title: How To Train As A Modern Day Ninja\n\nURL Source: https://gravity.fitness/blogs/training/how-to-train-as-a-modern-day-ninja?srsltid=AfmBOooRwBZUOU_IVeNbMVYQn36qvYzpO6y_AF3J4_xJvAa8qwCVkuM7\n\nPublished Time: 2022-08-03T13:46:59Z\n\nMarkdown Content:\nHow To Train As A Modern Day Ninja - Gravity Fitness Equipment\n===============\n                                                                                                 \n\nWarehouse Clearance Online Shop\n\nParallettes Weighted Vest Pull up Bars Get Started Calisthenics Bundles Gymnastic Rings Steel Mace & Indian Clubs Resistance Bands\n\nCalisthenics App Gravity Academy blog Our Story \n\nAccount Help & FAQs Search;)\n\n\n\n60 Day Extended Returns & 5 Year Warranty Spend £100 for FREE UK Mainland Delivery  \n\nOnline Shop\n\nBEST SELLERS Parallettes Weighted Vest Pull up Bars Get Started Calisthenics Bundles Gymnastic Rings Steel Mace & Indian Clubs Resistance Bands\n\n![Image 2 Calisthenics Equipment](https://gravity.fitness/collections/calisthenics-body-weight)![Image 3 Unconventional equipment](https://gravity.fitness/collections/unconventional-functional-fitness)![Image 4 Apparel & Accessories](https://gravity.fitness/collections/apparel-accessories)\n\nCalisthenics App\n\nGravity Academy blog\n\n![Image 5: logo](https://gravity.fitness/)\n\n*   Help & FAQs\n*   \n*   0\n\n\n\nHome Spotlight Training\n\nHow To Train As A Modern Day Ninja\n==================================\n\nAugust 03, 2022 3 min read\n\nHow To Train As A Modern Day Ninja\n\nCompared to the world of the ancient Vikings using their brute strength to overpower their enemies, or the combative Spartans – who used their savvy and tactics, the ancient clans of the ninja were spies and they employed agility, speed and subversive tactics to win their battles.\n\nThe ninja were highly skilled, and trained, in reconnaissance, espionage and infiltration. Their fighting skills involved complex martial arts, including ninjutsu, as well as their agility and light feet. This made the ninja very powerful enemies, as they were very difficult to follow or predict. But we are asking what does it take to become a modern day ninja? What skills and training do you need?\n\nWe need to start with a rounded approach that covers the whole body, but focuses on speed and agility, and not strength directly;\n\n**Aerobic Training** – We need to build up a good level of endurance through cardiovascular fitness and Interval Training at high intensities.  \n**Ballistic Training** – We also need to be build strength through the ankles, calves, quads and hamstrings, recruiting fast twitch muscle fibre using explosive jumping movements, whether unilaterally (one side), or bilaterally (both sides)  \n**Grip Strength** – Our hands, fingers and wrists need to be strong to haul ourselves upwards, or to take weight and impact.  \n**Flexibility and Mobility** – these two training facets will help stave off injuries and strengthen the body through its maximum ranges and unusual positions, whilst reinforcing joint, nervous system and muscle health.  \n**Speed Drills** – Hand and Foot speed are key to maintaining a ninjas way. Quick feet, hands and reflexes will ensure awareness and confidence in a variety of scenarios.\n\nFor aerobic training, we can practice bouts of LISS (Long Interval Steady State) Cardio work, whether running, rowing, climbing or any other sport, to build up our endurance. We need to keep our aerobic systems active to stay as ninja ready as possible. We can then look to incorporate sprints, boxing (or martial arts) and foot ladder drills to improve our ballistic speed.\n\nFurther to that we can improve ballistics by working on our knees over toes training, jump squats, jumping lunges, hop ups, or any work that involves drills that involve plyometrics and  work our kinetic chains throughout the body. Power and speed from rotation is key to mastering the ninja arsenal, so grab a weighted ball or medicine ball in your next session and you’ll never look back.\n\nGrip strength is something we can work using calisthenics and bar based work, including barbell training. Pull Ups, Deadlifts, Handstands, Clean And Press, Hack Squats and Muscle Ups are just some of the exercises we can use to help our grip strength and range. We also want to work our false grip to help us keep that ninja strength and agility in the most difficult circumstances.\n\nFlexibility and mobility are key to any ninjas mastery of their arts. Your body needs to be prepared, and strong enough, to explosively power out of any situation, regardless of position. Forward Rolls, Explosive Press ups, Burpees, Pull Ups to the chest and gymnastic work help with the explosiveness, but front split and mid split training will help your flexibility in the most amazing ways.\n\nI am a huge Bruce Lee fan, and I would recommend researching how he trains, he was improving his reflexes, speed and strength simultaneously. His methods used a lot of isometrics to improve his power, which was very rare at the time he was training. Also his mental acuity was amazing. Keeping mentally sharp is also vital to keep up with the way of the ninja. Your mental strength, determination and consistency are just as powerful as any fists.\n\nShow us you journey along the path of the ninja by tagging us @gravity.fitness on IG! We can’t wait to see how you’re getting on!\n\n![Image 7](https://www.gravityfitness.co.uk/collections/shop)\n\n![Image 8: Gravity Fitness Portable Pull up Rack & Bag, Optional Extension Kit Add to cart Gravity Fitness Portable Pull up Rack & Bag, Optional Extension Kit ------------------------------------------------------------------- £129.95](https://gravity.fitness/products/gravity-fitness-portable-bodyweight-pull-up-rack)\n\n507 reviews\n\n![Image 9: Graded - Gravity Fitness Portable Pull up Rack Add to cart Graded - Gravity Fitness Portable Pull up Rack ---------------------------------------------- £99.95 £129.95](https://gravity.fitness/products/grade-b-gravity-fitness-portable-pull-up-rack)\n\n45 reviews\n\n![Image 10: Gravity Fitness Wooden Gymnastic Rings Add to cart Gravity Fitness Wooden Gymnastic Rings -------------------------------------- £37.95](https://gravity.fitness/products/gravity-fitness-wooden-gymnastic-rings)\n\n315 reviews\n\n![Image 11: Gravity Fitness 10kg, 20kg & 30kg Weighted Vest Add to cart Gravity Fitness 10kg, 20kg & 30kg Weighted Vest ----------------------------------------------- £79.95](https://gravity.fitness/products/gravity-fitness-20kg-weighted-vest)\n\n266 reviews\n\n![Image 12: Gravity Fitness XL Adjustable Parallettes / Dips bars Add to cart Gravity Fitness XL Adjustable Parallettes / Dips bars ----------------------------------------------------- £79.95](https://gravity.fitness/products/gravity-fitness-xl-pro-parallettes-3-0-38mm-dip-bars)\n\n223 reviews\n\n![Image 13: Gravity Fitness Medium Pro Hybrid Parallettes PRE ORDER - Estimated Dispatch Date 30/05/2025 Gravity Fitness Medium Pro Hybrid Parallettes --------------------------------------------- £69.95](https://gravity.fitness/products/gravity-fitness-medium-pro-parallettes-3-0-38mm-bars)\n\n248 reviews\n\n![Image 14: Gravity Fitness Resistance Bands - Set of 4 Add to cart Gravity Fitness Resistance Bands - Set of 4 ------------------------------------------- £34.95](https://gravity.fitness/products/gravity-fitness-resistance-bands)\n\n83 reviews\n\n![Image 15: Gravity Fitness Wrist Support Wraps Add to cart Gravity Fitness Wrist Support Wraps ----------------------------------- £9.95](https://gravity.fitness/products/gravity-fitness-wrist-support-wraps)\n\n35 reviews\n\n![Image 16: Gravity Fitness Universal Door Pull up Bar Add to cart Gravity Fitness Universal Door Pull up Bar ------------------------------------------ £39.95](https://gravity.fitness/products/gravity-fitness-universal-door-pull-up-bar)\n\n66 reviews\n\n![Image 17: Gravity Fitness Advanced 4 in 1 Heavy Duty Workout/Dip Belt Add to cart Gravity Fitness Advanced 4 in 1 Heavy Duty Workout/Dip Belt ----------------------------------------------------------- £39.95](https://gravity.fitness/products/gravity-fitness-advanced-4-in-1-heavy-duty-workout-dip-belt)\n\n29 reviews\n\n![Image 18: Gravity Fitness Travellettes Small Parallettes Add to cart Gravity Fitness Travellettes Small Parallettes ---------------------------------------------- £44.95](https://gravity.fitness/products/gravity-fitness-small-pro-parallettes-3-0-38mm-bars)\n\n248 reviews\n\n![Image 19: Gravity Fitness 2 in 1 Squat ramps Add to cart Gravity Fitness 2 in 1 Squat ramps ---------------------------------- £39.95](https://gravity.fitness/products/gravity-fitness-squat-ramp)\n\n22 reviews\n\n![Image 20: Gravity Fitness Tri Folding Fitness Mat Add to cart Gravity Fitness Tri Folding Fitness Mat --------------------------------------- £29.95 £39.95](https://gravity.fitness/products/gravity-fitness-tri-folding-fitness-mat)\n\n26 reviews\n\n![Image 21: Gravity Fitness Long Hybrid Parallettes Add to cart Gravity Fitness Long Hybrid Parallettes --------------------------------------- £69.95](https://gravity.fitness/products/gravity-fitness-long-parallettes)\n\n248 reviews\n\n![Image 22: Gravity Fitness Gymnast Grips & Hand Protectors Add to cart Gravity Fitness Gymnast Grips & Hand Protectors ----------------------------------------------- £9.95 £24.95](https://gravity.fitness/products/gravity-fitness-gymnastic-grips)\n\n4 reviews\n\n![Image 23: Gravity Fitness 75mm Cannonball Pull Up Grips Add to cart Gravity Fitness 75mm Cannonball Pull Up Grips --------------------------------------------- £34.95](https://gravity.fitness/products/gravity-fitness-cannonball-grips)\n\n10 reviews\n\n![Image 24: Gravity Fitness 48mm Pillar Pull Up Grips Add to cart Gravity Fitness 48mm Pillar Pull Up Grips ----------------------------------------- £29.95](https://gravity.fitness/products/gravity-fitness-pipebomb-grips)\n\n8 reviews\n\n![Image 25: Gravity Fitness Pull up Rack Extension Kit PRE ORDER - Estimated Dispatch 01/06/2025 Gravity Fitness Pull up Rack Extension Kit ------------------------------------------ £49.95](https://gravity.fitness/products/gravity-fitness-pull-up-rack-extension-kit)\n\n18 reviews\n\n![Image 26: Get started Calisthenics Bundle Add to cart Get started Calisthenics Bundle ------------------------------- £189.95 £232.75 Save £42.80 £189.95 £232.75](https://gravity.fitness/products/get-started-calisthenics-bundle)\n\n10 reviews\n\n![Image 27: Gravity Fitness Liquid Chalk Add to cart Gravity Fitness Liquid Chalk ---------------------------- £5.95](https://gravity.fitness/products/gravity-fitness-chalk)\n\n2 reviews\n\n![Image 28: Gravity Fitness Strongman Sandbag 50kg - 150kg Add to cart Gravity Fitness Strongman Sandbag 50kg - 150kg ---------------------------------------------- £29.95](https://gravity.fitness/products/gravity-fitness-strong-sandbag-50kg-150kg)\n\n28 reviews\n\nRelated posts\n-------------\n\n![Image 29: Get in the shape of your life this summer with just a pull up bar Get in the shape of your life this summer with just a pull up bar -----------------------------------------------------------------](https://gravity.fitness/blogs/training/get-in-the-shape-of-your-life-this-summer-with-just-a-pull-up-bar)![Image 30: Why Can’t I Progress in Calisthenics? 7 Reasons You're Stuck (And How to Fix Them) Why Can’t I Progress in Calisthenics? 7 Reasons You're Stuck (And How to Fix Them) ----------------------------------------------------------------------------------](https://gravity.fitness/blogs/training/why-can-t-i-progress-in-calisthenics-7-reasons-youre-stuck-and-how-to-fix-them)![Image 31: Is Pilates a form of calisthenics? Is Pilates a form of calisthenics? ----------------------------------](https://gravity.fitness/blogs/training/is-pilates-a-form-of-calisthenics)![Image 32: Stephen Graham’s Workout Plan for A Thousand Blows: Proof That Strength Has No Age Limit Stephen Graham’s Workout Plan for A Thousand Blows: Proof That Strength Has No Age Limit ----------------------------------------------------------------------------------------](https://gravity.fitness/blogs/training/stephen-graham-s-workout-plan-for-a-thousand-blows-proof-that-strength-has-no-age-limit)![Image 33: The Goku Weighted Vest Challenge: Can You Train Like a Saiyan for 30 Days? The Goku Weighted Vest Challenge: Can You Train Like a Saiyan for 30 Days? --------------------------------------------------------------------------](https://gravity.fitness/blogs/training/the-goku-weighted-vest-challenge-can-you-train-like-a-saiyan-for-30-days)![Image 34: The Complete Calisthenics Workout from Tom Peto The Complete Calisthenics Workout from Tom Peto -----------------------------------------------](https://gravity.fitness/blogs/training/the-complete-calisthenics-workout-from-tom-peto)![Image 35: Why you shouldn't lift weights unless you can do calisthenics Why you shouldn't lift weights unless you can do calisthenics -------------------------------------------------------------](https://gravity.fitness/blogs/training/why-you-shouldnt-lift-weights-unless-you-can-do-calisthenics)![Image 36: Who is Behind Hollywood’s Most Impressive Physiques? Who is Behind Hollywood’s Most Impressive Physiques? ----------------------------------------------------](https://gravity.fitness/blogs/training/who-is-behind-hollywood-s-most-impressive-physiques)\n\nView All\n\nStay in the loop\n\n  Subscribe\n\n\n\nQuick Links 60 Day Returns Policy Shop Contact us 5 Year Warranty Shipping info Calisthenics Park Map\n\nMore Links Privacy Policy T&Cs Police & Fire Discount NHS Discount Military Discount Student Discount\n\n\n\n© 2024 Gravity Fitness Equipment. All rights reserved. Born Active Ltd 08648899\n\n       \n\n  \n\n  \n\nJudge.me \n\n£5 Off?\n\n\n\nWant £5 Off?\n============\n\nSign up for £5 off your order\n\nEmail\n\nGET OFFER\n\nBy signing up, you agree to receive email marketing\n\nNo, thanks\n\n\n"
}